const myMusic = {
    "code": 200,
    "message": "成功!",
    "result": [{
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=86360",
            "pic": "http://p2.music.126.net/2-_sPmCBnN6VfwFmONRy2Q==/46179488378975.jpg?param=300x300",
            "type": "netease",
            "title": "忘记时间",
            "lrc": "[00:33.250]沉默着走了有 多遥远\n[00:40.690]抬起头 蓦然间 才发现\n[00:47.580]一直倒退 倒退到原点\n[00:55.140]倔强坚持 对抗时间\n[01:02.840]说好了的永远 断了线\n[01:10.260]期许了 不变的 却都已改变\n[01:17.060]紧闭 双眼 才能看得见\n[01:24.780]那些曾经温暖 鲜艳过的画面\n[01:31.420]渐渐地忘记 赶不上明天\n[01:35.090]只要用力地抓紧了想念\n[01:39.300]明天再也 没有你的笑脸\n[01:46.510]渐渐地忘记 忘记了时间\n[01:50.230]我只要沿着记忆的路线\n[01:54.410]到最深处 纵然那只是瞬间\n[02:02.570]当眼泪 滑落的 是句点\n[02:09.920]心里面 始终你 从没有走远\n[02:16.810]耳边 誓言 还在回旋\n[02:23.890]我会好好珍惜 没有你的明天\n[02:31.120]\n[03:01.130]渐渐地忘记 赶不上明天\n[03:04.810]只要用力地抓紧了想念\n[03:09.000]明天再也 没有你的笑脸\n[03:15.900]渐渐地忘记 忘记了时间\n[03:19.610]我只要沿着记忆的路线\n[03:24.040]到最深处 纵然那只是瞬间\n[03:30.660]渐渐地忘记 忘记了时间\n[03:34.370]我只要沿着记忆的路线\n[03:38.790]到最深处 纵然那只是瞬间\n",
            "songid": 86360,
            "url": "http://music.163.com/song/media/outer/url?id=86360.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=4875306",
            "pic": "http://p2.music.126.net/4tTN8CnR7wG4E1cauIPCvQ==/109951163240682406.jpg?param=300x300",
            "type": "netease",
            "title": "逍遥叹",
            "lrc": "[00:26.490] 岁月难得沉默秋风厌倦漂泊\n[00:32.999] 夕阳赖着不走挂在墙头舍不得我\n[00:39.109] 昔日伊人耳边话已和潮声向东流\n[00:45.879] 再回首往事也随枫叶一片片落\n[00:52.709] 爱已走到尽头恨也放弃承诺\n[00:59.490] 命运自认幽默想法太多由不得我\n[01:05.989] 壮志凌云几分愁知己难逢几人留\n[01:12.599] 再回首却闻笑传醉梦中\n[01:20.539] 笑叹词穷古痴今狂终成空\n[01:26.979] 刀钝刃乏恩断义绝梦方破\n[01:33.549] 路荒已叹饱览足迹没人懂\n[01:40.119] 多年望眼欲穿过红尘滚滚我没看透\n[01:47.209] 自嘲墨尽千情万怨英杰愁\n[01:53.549] 曲终人散发花鬓白红颜殁\n[02:00.490] 烛残未觉与日争辉图消瘦\n[02:06.979] 当泪干血隐狂涌白雪纷飞都成红\n[02:40.090] 爱已走到尽头恨也放弃承诺\n[02:46.000] 命运自认幽默想法太多由不得我\n[02:53.290] 壮志凌云几分愁知己难逢几人留\n[03:00.690] 再回首却闻笑传醉梦中\n[03:08.470] 笑叹词穷古痴今狂终成空\n[03:15.040] 刀钝刃乏恩断义绝梦方破\n[03:21.790] 路荒已叹饱览足迹没人懂\n[03:28.410] 多年望眼欲穿过红尘滚滚我没看透\n[03:35.800] 自嘲墨尽千情万怨英杰愁\n[03:42.300] 曲终人散发花鬓白红颜殁\n[03:48.980] 烛残未觉与日争辉图消瘦\n[03:55.670] 当泪干血隐狂涌白雪纷飞都成红\n[04:02.700] 笑叹词穷古痴今狂终成空\n[04:08.910] 刀钝刃乏恩断义绝梦方破\n[04:15.730] 路荒已叹饱览足迹没人懂\n[04:22.310] 多年望眼欲穿过红尘滚滚我没看透\n[04:29.690] 自嘲墨尽千情万怨英杰愁\n[04:36.240] 曲终人散发花鬓白红颜殁\n[04:42.950] 烛残未觉与日争辉图消瘦\n[04:49.540] 当泪干血隐狂涌白雪纷飞都成红\n",
            "songid": 4875306,
            "url": "http://music.163.com/song/media/outer/url?id=4875306.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=4875310",
            "pic": "http://p2.music.126.net/4tTN8CnR7wG4E1cauIPCvQ==/109951163240682406.jpg?param=300x300",
            "type": "netease",
            "title": "六月的雨",
            "lrc": "[00:21.600]一场雨 把我困在这里\n[00:25.600]你冷漠的表情 会让我伤心\n[00:30.208]六月的雨 就是无情的你\n[00:35.018]伴随着点点滴滴 痛击我心里\n[00:39.717]HO~我不相信 你不是故意的\n[00:44.717]却为何把我丢弃在风雨里\n[00:50.170]HO~我不忍心 也不想背叛你\n[00:54.298]惟有默默等你 回心转意\n[01:00.597]我没有放弃 也不会离你而去\n[01:06.038]哪怕要分开 我依然等你\n[01:10.558]我全心全意 等你的消息\n[01:15.038]终会有一天 你会相信我\n[01:20.418]我爱你\n[01:22.689]一场雨 想念你\n[01:24.168]在我的心中都不可比拟\n[01:31.427]你走后 什么都\n[01:34.499]已经消失在风雨里\n[01:41.278]一场雨 想念你\n[01:43.797]我爱你 我爱你\n[02:00.788]一场雨 把我困在这里\n[02:03.717]你冷漠的表情 会让我伤心\n[02:08.500]六月的雨 就是无情的你\n[02:13.300]伴随着点点滴滴 痛击我心里\n[02:18.090]HO~我不相信 你不是故意的\n[02:23.700]却为何把我丢弃在风雨里\n[02:28.600]HO~我不忍心 也不想背叛你\n[02:33.410]惟有默默等你 回心转意\n[02:41.400]我没有放弃 也不会离你而去\n[02:45.400]哪怕要分开 我依然等你\n[02:49.420]我全心全意 等你的消息\n[02:54.150]总会有一天 你会相信我\n[02:59.650]我爱你\n[03:01.680]一场雨 想念你\n[03:03.490]在我的心中都不可比拟\n[03:09.700]你走后 什么都\n[03:13.040]已经消失在风雨里\n[03:21.100]一场雨 想念你\n[03:23.500]我爱你 我爱你\n",
            "songid": 4875310,
            "url": "http://music.163.com/song/media/outer/url?id=4875310.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌,白冰",
            "link": "http://music.163.com/#/song?id=28378115",
            "pic": "http://p2.music.126.net/yZzy8izzytOf07anjx6dpQ==/6042915906456903.jpg?param=300x300",
            "type": "netease",
            "title": "美丽的神话",
            "lrc": "[00:23.99]解开我最神秘的等待\n[00:29.59]\n[00:30.90]星星坠落风在吹动\n[00:36.17]\n[00:38.73]终于再将你拥入怀中\n[00:44.85]\n[00:46.10]两颗心颤抖\n[00:50.69]\n[00:53.59]相信我不变的真心\n[01:00.52]\n[01:01.78]千年等待有我承诺\n[01:06.52]\n[01:08.39]无论经过多少的寒冬\n[01:15.46]\n[01:16.78]我决不放手\n[01:21.03]\n[01:22.28]紧紧久久与我牵绊 这副十指扣\n[01:30.66]\n[01:31.23]等到来生擦肩回眸 再次的相守\n[01:38.10]\n[01:38.92]苦苦痛痛爱的解救 愿与你同受\n[01:46.48]却连一句我爱你都 不能说出口\n[01:53.54]\n[02:10.72]每一夜被心痛穿越\n[02:16.34]\n[02:17.40]思念永没有终点\n[02:22.43]\n[02:24.93]早习惯了孤独相随\n[02:31.38]\n[02:32.69]我微笑面对\n[02:37.26]\n[02:41.00]相信我你选择等待\n[02:46.94]\n[02:48.50]再多苦痛也不闪躲\n[02:53.27]\n[02:55.15]只有你的温柔能解救\n[03:02.15]\n[03:03.03]无边的冷漠\n[03:07.84]\n[03:10.59]紧紧久久与我牵绊 这副十指扣\n[03:17.90]等到来生擦肩回眸 再次的相守\n[03:25.51]苦苦痛痛爱的解救 愿与你同受\n[03:32.95]却连一句我爱你都 不能说出口\n[03:40.13]\n[03:40.94]让爱成为你我心中 那永远盛开的花\n[03:47.77]\n[03:48.27]穿越时空决不低头永不放弃的梦\n[03:55.24]\n[03:55.75]苦苦痛痛爱的解救 愿与你同受\n[04:02.84]\n[04:03.47]却连一句我爱你都 不能说出口\n[04:10.78]\n[04:11.60]让爱成为你我心中 那永远盛开的花\n[04:18.22]\n[04:18.72]说好了给我的永久 这一次不要先走\n[04:26.35]唯有真爱追随你我 穿越无尽时空\n[04:33.97]你会知道我等着你 在千年之后\n[04:41.03]\n[04:45.35]爱是心中唯一不变美丽的神话\n",
            "songid": 28378115,
            "url": "http://music.163.com/song/media/outer/url?id=28378115.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=391566",
            "pic": "http://p2.music.126.net/Lq6GVJJHEQ5-LetvmJZTyw==/109951163200241437.jpg?param=300x300",
            "type": "netease",
            "title": "一吻天荒",
            "lrc": "[00:27.440]我会忍受 所有的寂寞\n[00:32.440]也会感叹时光的蹉跎\n[00:38.210]你的眼泪像一颗琥珀\n[00:42.860]融化了这世间的落寞\n[00:48.160]\n[00:48.820]谁在寻找 大雨滂沱\n[00:51.450]挣脱谁的怀抱\n[00:54.090]每分每秒\n[00:55.600]对我都算是煎熬\n[00:59.640]谁对谁错 爱多爱少\n[01:02.380]不需要再计较\n[01:05.610]只是我 曾这样深爱过\n[01:10.660]\n[01:11.520]一瞬间紧紧拥抱\n[01:13.790]无处可逃 一吻天荒\n[01:16.730]永远不会凋谢的花\n[01:22.550]一转眼忘了时间\n[01:24.320]丢了感觉 黑了世界\n[01:28.170]再逞强 再疯狂 也会伤\n[01:33.430]\n[01:34.900]不知 不觉 后知 后觉\n[01:36.620]然后 发现 失去 知觉\n[01:39.860]（到了黑夜）\n[01:40.510]忽快 忽慢 忽高 忽低\n[01:42.840]时间 过了（不再上演）\n[01:45.720]好的 坏的 笑的 哭的\n[01:47.790]爱的 恨的 都算 什么\n[01:49.810]（想你的脸）\n[01:51.080]想的 念的 关于 你的\n[01:53.350]都是 昨天（认了）\n[01:56.330]\n[01:57.300]爱像一片 宽阔的湖泊\n[02:02.200]拯救生命干枯的沙丘\n[02:07.710]相爱更像是致命邂逅\n[02:12.970]就让我不知天高地厚\n[02:16.190]\n[02:18.860]谁在寻找 大雨滂沱\n[02:21.440]挣脱谁的怀抱\n[02:24.180]每分每秒\n[02:25.750]对我都算是煎熬\n[02:29.690]谁对谁错 爱多爱少\n[02:32.520]不需要再计较\n[02:35.300]只是我 曾这样深爱过\n[02:40.510]\n[02:42.440]一瞬间紧紧拥抱\n[02:43.610]无处可逃 一吻天荒\n[02:46.850]永远不会凋谢的花\n[02:52.260]一转眼忘了时间\n[02:54.520]丢了感觉 黑了世界\n[02:58.060]再逞强 再疯狂 也会伤\n[03:02.060]\n[03:16.880]一瞬间紧紧拥抱\n[03:17.310]无处可逃 一吻天荒\n[03:20.550]永远不会凋谢的花\n[03:26.010]一转眼忘了时间\n[03:28.190]丢了感觉 黑了世界\n[03:31.770]再逞强 再疯狂 也会伤\n[03:36.120]\n[03:39.770]不知 不觉 后知 后觉\n[03:40.730]然后 发现 失去 知觉\n[03:42.550]（到了黑夜）\n[03:44.220]忽快 忽慢 忽高 忽低\n[03:46.240]时间 过了（不再上演）\n[03:49.570]好的 坏的 笑的 哭的\n[03:52.260]爱的 恨的 都算 什么\n[03:54.030]（想你的脸）\n[03:55.090]想的 念的 关于 你的\n[03:57.320]都是 昨天（认了）\n[03:59.440]\n",
            "songid": 391566,
            "url": "http://music.163.com/song/media/outer/url?id=391566.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=86365",
            "pic": "http://p2.music.126.net/2-_sPmCBnN6VfwFmONRy2Q==/46179488378975.jpg?param=300x300",
            "type": "netease",
            "title": "光棍",
            "lrc": "[by:蒲公英没约定]\n[ti:光棍]\n[ar:胡歌]\n[al:仙剑奇侠传三 电视原声带]\n[by:蒲公英没约定]\n[00:10.91]每天都 伸着懒腰大摇大摆的享受\n[00:14.88]这春暖花开 多潇洒\n[00:19.48]为感情繁琐 那太傻\n[00:25.33]乘着风 满世界嘻嘻哈哈的乱逛\n[00:29.31]有太多新奇等我 逍遥啊\n[00:34.03]天知道寂寞 什么滋味\n[00:39.89]乘着风 满世界嘻嘻哈哈的乱逛\n[00:43.89]有太多新奇等我 逍遥啊\n[00:48.56]天知道寂寞 什么滋味 我先开心\n[00:58.49]其他的事想它干嘛\n[01:03.14]我以为 我就是自由自在的一个人\n[01:08.35]为什么我一天没见到你就 焦躁难忍\n[01:14.67]我怎么 变得这么蠢\n[01:18.02]我以为 我就是这样快乐的光棍\n[01:22.89]却为何老是 拼命跟自己斗气较真\n[01:29.50]才发现 我已经 爱上你\n[01:36.78]爱上你……\n[01:55.87]我以为 我就是自由自在的一个人\n[02:01.09]为什么我一天没见到你就 焦躁难忍\n[02:07.39]我怎么 变得这么蠢\n[02:10.71]我以为 我就是这样快乐的光棍\n[02:15.56]却为何老是 拼命跟自己斗气较真\n[02:22.16]才发现 我已经 爱上你\n[02:33.12]爱上你……\n[02:40.28]（唉，行了行了，够了够了，知道了）\n",
            "songid": 86365,
            "url": "http://music.163.com/song/media/outer/url?id=86365.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=4874864",
            "pic": "http://p2.music.126.net/c18s6dG_IM1jihwKZh6Eag==/109951163188724434.jpg?param=300x300",
            "type": "netease",
            "title": "天亮以后",
            "lrc": "[00:33.569]客栈前那一座桥\n[00:37.949]或许我们都到不了\n[00:40.979]没有理由在苦笑\n[00:44.539]只是煎熬\n[00:48.599]反复练习的拥抱\n[00:52.289]天亮以后就看不到\n[00:55.669]不能陪你到苍老\n[00:59.119]陪你到老\n[01:02.159]我不知道\n[01:05.289]还有谁能像我让你依靠\n[01:10.200]我只希望\n[01:11.769]你会牢记我的好 (牢记我的好)\n[01:18.250]天亮以后 就再也牵不到你的手\n[01:22.610]天亮以后 我会慢慢离开你的梦\n[01:26.280]不敢说\n[01:28.179]再见就是无法说出口\n[01:32.769]天亮以后 留住你该用什么理由\n[01:37.099]天亮以后 留下的就只剩下寂寞\n[01:40.920]别难过\n[01:42.659]所有的痛都由我默默承受\n[02:10.800]我以为我做得到\n[02:14.680]抱着你到天荒地老\n[02:17.620]爱你我感到骄傲\n[02:21.139]什么都好\n[02:24.000]期待着你的拥抱\n[02:28.870]也许这机会太渺小\n[02:32.750]流着眼泪苦着笑\n[02:35.810]我怎么逃\n[02:39.099]空荡的梦\n[02:40.649]怎么写我们的从今以后\n[02:46.400]握紧着手\n[02:47.659]看不到再见的尽头\n[02:53.640]天亮以后 就再也牵不到你的手\n[02:57.099]天亮以后 我会慢慢离开你的梦\n[03:01.290]不敢说\n[03:02.620]再见就是无法说出口\n[03:07.300]天亮以后 留住你该用什么理由\n[03:11.800]天亮以后 留下的就只剩下寂寞\n[03:15.900]别难过\n[03:17.559]所有的痛都由我默默承受\n[03:23.999]music~~\n[03:30.309]不敢说 再见就是无法说出口\n[03:37.100]woo~~天亮以后 留住你该用什么理由\n[03:41.999]天亮以后 留下的就只剩下寂寞\n[03:44.939]别难过\n[03:47.260]所有的痛都由我默默承受\n[03:55.159]\n",
            "songid": 4874864,
            "url": "http://music.163.com/song/media/outer/url?id=4874864.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌,阿兰",
            "link": "http://music.163.com/#/song?id=101818",
            "pic": "http://p2.music.126.net/E9ywOW6ujuzVuYKEFKyrug==/130841883719608.jpg?param=300x300",
            "type": "netease",
            "title": "一念执着",
            "lrc": "[by:灰鸟烬]\n[ti:一念执着]\n[ar:胡歌、阿兰]\n[al:]\n[00:00.00] 作曲 : 严艺丹\n[00:01.00] 作词 : 严艺丹\n[00:22.43]一眼之念\n[00:25.15]一念执着\n[00:28.61]注定就此飞蛾扑火\n[00:32.48]明知是祸为何还不知所措\n[00:42.10]最好不见最好不念\n[00:47.11]如此才可不与你相恋\n[00:52.14]多一步的擦肩\n[00:56.79]就步步沦陷\n[01:03.37]是时间的过错让我们只能错过\n[01:10.03]我多想念你多遥远\n[01:13.44]早知道是苦果\n[01:15.77]这一刻也不想逃脱\n[01:20.22]可惜这字眼太刺眼\n[01:24.75]两个世界之后\n[01:31.15]只好情深缘浅\n[01:53.98]一眼之念\n[01:56.78]一念执着\n[02:00.47]注定就此飞蛾扑火\n[02:04.15]明知是祸为何还不知所措\n[02:13.73]最好不见最好不念\n[02:18.90]如此才可不与你相恋\n[02:24.04]多一步的擦肩\n[02:28.17]就步步沦陷\n[02:32.93]是时间的过错让我们只能错过\n[02:39.56]我多想念你多遥远\n[02:42.82]早知道是苦果\n[02:45.29]这一刻也不想逃脱\n[02:49.39]可惜这字眼太刺眼\n[02:54.04]两个世界之后\n[02:59.96]是时间的过错我们只能错过\n[03:04.96]我有多么想念\n[03:07.45]你有多遥远\n[03:09.74]早知道结局是不能抗拒的错\n[03:16.18]停留在这一刻\n[03:21.67]不想逃脱\n[03:26.39]是时间的过错让我们只能错过\n[03:33.64]我多想念你多遥远\n[03:36.68]早知道是苦果\n[03:39.10]这一刻也不想逃脱\n[03:43.43]可惜这字眼太刺眼\n[03:47.86]两个世界之后\n[03:54.29]只好情深缘浅\n",
            "songid": 101818,
            "url": "http://music.163.com/song/media/outer/url?id=101818.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=34057518",
            "pic": "http://p2.music.126.net/Ztk5uyPhXS5Ygulu5y4NUA==/3430476280187276.jpg?param=300x300",
            "type": "netease",
            "title": "风起时",
            "lrc": "[by:二逗子]\n[00:00.00] 作曲 : 孟可\n[00:01.00] 作词 : 海宴\n[00:22.860]变幻 风云几卷\n[00:28.360]乱世起惊澜\n[00:35.700]血仍殷 何人心念\n[00:41.880]烈火清平愿\n[00:49.730]慧剑 借别红颜\n[00:55.780]无意续余年\n[01:02.850]帝阙巍 豪气仍在\n[01:09.620]冰心誓破长夜天\n[01:21.770]\n[01:22.440]昔年朱弓 壁上空悬\n[01:30.320]征途望断 铁甲犹寒\n[01:37.180]明眸在心 青山难掩\n[01:43.820]江山如画 是我心言\n[01:49.730]关山横槊 谁可补天\n[01:57.630]碧血长枪 昨日少年\n[02:04.570]孤影归途 不见烽烟\n[02:11.220]一笔千秋 后人心间\n[02:18.710]\n[02:18.850]风起\n[02:22.920]\n[02:50.770]云散\n[02:57.830]\n",
            "songid": 34057518,
            "url": "http://music.163.com/song/media/outer/url?id=34057518.mp3"
        },
        {
            'isSong': '',
            "author": "胡歌",
            "link": "http://music.163.com/#/song?id=391568",
            "pic": "http://p2.music.126.net/Lq6GVJJHEQ5-LetvmJZTyw==/109951163200241437.jpg?param=300x300",
            "type": "netease",
            "title": "指纹",
            "lrc": "[00:18.539]我们 变成一对 差点缘分\n[00:23.999]装成朋友少点天份\n[00:27.729]坦然不是每个人都能\n[00:33.349]我们 结成伴趟过的天真\n[00:38.809]没了天真选择孤身\n[00:42.539]以为成熟需要不诚恳\n[00:48.249]你也不承认\n[00:51.919]自己会失衡\n[00:55.229]坚持着分寸\n[00:58.909]却又依赖着余温\n[01:04.229]\n[01:05.900]旋转几轮 变成我们\n[01:08.669]深刻的指纹\n[01:12.699]留在每个 爱过的人\n[01:16.900]心房里加温\n[01:19.849]爱过几番 恨过几轮\n[01:23.539]越仔细越疼\n[01:27.249]等了多久 忍过青春\n[01:31.190]却憎恨 别人奋不顾身\n[01:38.999]\n[01:49.559]我们 抓紧了所谓的人生\n[01:55.128]追逐爱恨交换灵魂\n[01:58.839]选择自己满意的身份\n[02:04.519]我何苦又问\n[02:08.199]你是否认真\n[02:11.999]指尖的年轮\n[02:16.99]是催促我们\n[02:17.599]沉沦的印证\n[02:21.149]旋转几轮 变成我们\n[02:21.899]\n[02:24.949]深刻的指纹\n[02:28.629]留在每个 爱过的人\n[02:32.309]心房里加温\n[02:36.599]爱过几番 恨过几轮\n[02:39.779]越仔细越疼\n[02:43.529]等了多久 忍过青春\n[02:47.269]却憎恨 别人奋不顾身\n[02:58.299]\n[03:05.989]旋转几轮 变成我们\n[03:09.819]深刻的指纹\n[03:13.799]留在每个 爱过的人\n[03:17.149]心房里加温\n[03:20.829]爱过几番 恨过几轮\n[03:24.589]越仔细越疼\n[03:28.239]等了多久 忍过青春\n[03:32.499]却憎恨 别人奋不顾身\n",
            "songid": 391568,
            "url": "http://music.163.com/song/media/outer/url?id=391568.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=167876",
            "pic": "http://p2.music.126.net/Md3RLH0fe2a_3dMDnfqoQg==/18590542604286213.jpg?param=300x300",
            "type": "netease",
            "title": "有何不可",
            "lrc": "[00:00.00] 作曲 : 许嵩\n[00:01.00] 作词 : 许嵩\n[00:21.940]天空好想下雨\n[00:24.080]我好想住你隔壁\n[00:26.510]傻站在你家楼下\n[00:29.200]抬起头数乌云\n[00:30.860]如果场景里出现一架钢琴\n[00:33.340]我会唱歌给你听\n[00:35.600]哪怕好多盆水往下淋\n[00:40.760]夏天快要过去\n[00:43.040]请你少买冰淇淋\n[00:45.380]天凉就别穿短裙\n[00:47.530]别再那么淘气\n[00:49.760]如果有时不那么开心\n[00:52.170]我愿意将格洛米借给你\n[00:54.720]你其实明白我心意\n[00:57.990]为你唱这首歌没有什么风格\n[01:02.680]它仅仅代表着我想给你快乐\n[01:07.540]为你解冻冰河为你做一只扑火的飞蛾\n[01:12.700]没有什么事情是不值得\n[01:17.189]为你唱这首歌没有什么风格\n[01:21.700]它仅仅代表着我希望你快乐\n[01:26.390]为你辗转反侧为你放弃世界有何不可\n[01:32.030]夏末秋凉里带一点温热有换季的颜色\n[01:40.740]\n[01:57.910]天空好想下雨\n[01:59.680]我好想住你隔壁\n[02:02.900]傻站在你家楼下\n[02:04.750]抬起头数乌云\n[02:07.090]如果场景里出现一架钢琴\n[02:09.780]我会唱歌给你听\n[02:11.880]哪怕好多盆水往下淋\n[02:16.230]夏天快要过去\n[02:19.250]请你少买冰淇淋\n[02:22.390]天凉就别穿短裙\n[02:23.820]别再那么淘气\n[02:26.090]如果有时不那么开心\n[02:28.530]我愿意将格洛米借给你\n[02:30.920]你其实明白我心意\n[02:34.230]为你唱这首歌没有什么风格\n[02:38.880]它仅仅代表着我想给你快乐\n[02:43.740]为你解冻冰河为你做一只扑火的飞蛾\n[02:49.310]没有什么事情是不值得\n[02:53.320]为你唱这首歌没有什么风格\n[02:57.980]它仅仅代表着我希望你快乐\n[03:02.900]为你辗转反侧为你放弃世界有何不可\n[03:08.400]夏末秋凉里带一点温热\n[03:12.440]\n[03:21.830]为你解冻冰河为你做一只扑火的飞蛾\n[03:27.520]没有什么事情是不值得\n[03:31.429]为你唱这首歌没有什么风格\n[03:36.100]它仅仅代表着我希望你快乐\n[03:40.850]为你辗转反侧为你放弃世界有何不可\n[03:46.550]夏末秋凉里带一点温热有换季的颜色\n",
            "songid": 167876,
            "url": "http://music.163.com/song/media/outer/url?id=167876.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=167655",
            "pic": "http://p2.music.126.net/6TNYBV2rezZLiwsGYBgmPw==/123145302311773.jpg?param=300x300",
            "type": "netease",
            "title": "幻听",
            "lrc": "[00:35.379]在远方的时候\n[00:37.298]又想你到泪流\n[00:42.438]这矫情的措辞结构\n[00:46.698]经历过的人会懂\n[00:50.779]那些不堪言的疼痛\n[00:54.989]也就是我自作自受\n[00:59.298]你没有装聋\n[01:02.809]你真没感动\n[01:06.279]\n[01:07.908]一个人的时候\n[01:10.699]偷偷看你的微博\n[01:15.288]你转播的歌好耳熟\n[01:18.408]我们坐一起听过\n[01:23.359]当日嫌它的唱法做作\n[01:27.899]现在听起来竟然很生动\n[01:32.219]可能是时光让耳朵变得宽容\n[01:38.899]\n[01:40.210]如今一个人听歌总是会觉得失落\n[01:44.728]幻听你在我的耳边轻轻诉说\n[01:49.300]夜色多温柔\n[01:51.800]你有多爱我\n[01:56.288]如今一个人听歌总是会觉得难过\n[02:01.219]爱已不在这里我却还没走脱\n[02:04.899]列表里的歌\n[02:08.000]随过往流动\n[02:11.950]\n[02:29.360]一个人的时候\n[02:32.340]偷偷看你的微博\n[02:36.260]你每天做了些什么\n[02:40.270]我都了然于胸\n[02:44.450]当时嫌你的蠢话太多\n[02:48.460]现在回想起画面已泛旧\n[02:53.200]可能是孤独让情绪变得脆弱\n[02:59.420]\n[03:02.200]如今一个人听歌总是会觉得失落\n[03:05.910]幻听你在我的耳边轻轻诉说\n[03:09.680]夜色多温柔\n[03:11.820]你有多爱我\n[03:17.290]如今一个人听歌总是会觉得难过\n[03:22.380]爱已不在这里我却还没走脱\n[03:26.300]列表里的歌\n[03:28.300]随过往流动\n[03:32.700]\n[03:34.200]如今一个人听歌总是会觉得失落\n[03:41.490]幻听你在我的耳边轻轻诉说\n[03:44.320]夜色多温柔\n[03:46.720]你有多爱我\n[03:52.790]如今一个人听歌总是会觉得难过\n[03:56.730]爱已不在这里我却还没走脱\n[04:00.860]如果你回头\n[04:03.299]不要放下我\n[04:06.970]\n[04:17.970]\n",
            "songid": 167655,
            "url": "http://music.163.com/song/media/outer/url?id=167655.mp3"
        },
        {
            "author": "许嵩,何曼婷",
            "link": "http://music.163.com/#/song?id=167827",
            "pic": "http://p2.music.126.net/rUBN_BOm5C2zXrX6deiH7g==/111050674419060.jpg?param=300x300",
            "type": "netease",
            "title": "素颜",
            "lrc": "[by:殇丿灬星空]\n[ti:素颜]\n[00:00.00] 作曲 : 许嵩\n[00:01.00] 作词 : 许嵩\n[00:12.750]又是一个安静的晚上\n[00:15.600]一个人窝在摇椅里乘凉\n[00:18.540]我承认这样真的很安详\n[00:20.870]和楼下老爷爷一样\n[00:24.230]听说你还在搞什么原创\n[00:27.050]搞来搞去好像也就这样\n[00:29.910]不如花点时间想想\n[00:32.000]琢磨一下模样\n[00:35.330]今夜化了美美的妆\n[00:38.150](我相信是很美美的装)\n[00:41.180]我摇晃在舞池中央\n[00:44.010](那种体态可以想象)\n[00:47.150]我做我的改变 又何必纠结\n[00:51.210]那就拜托别和我碰面\n[00:56.860]如果再看你一眼\n[00:59.570]是否还会有感觉\n[01:02.290]当年素面朝天要多纯洁就有多纯洁\n[01:08.010]不画扮熟的眼线\n[01:10.740]不用抹匀粉底液\n[01:13.770]暴雨天 照逛街\n[01:16.560]偷笑别人花了脸\n[01:19.290]如果再看你一眼\n[01:22.190]是否还会有感觉\n[01:25.060]最真实的喜怒哀乐全都埋葬在昨天\n[01:30.600]不掺任何的表演\n[01:33.280]轰轰烈烈那几年\n[01:36.240]我怀念 别怀念\n[01:39.130]怀念也回不到从前\n[02:00.320]又是一个安静的晚上\n[02:02.680]一个人窝在摇椅里乘凉\n[02:05.580]我承认这样真的很安详\n[02:08.070]和楼下老爷爷一样\n[02:11.350]听说你还在搞什么原创\n[02:14.440]搞来搞去好像也就这样\n[02:17.200]不如花点时间想想\n[02:19.190]琢磨一下模样\n[02:22.730]今夜化了美美的妆\n[02:25.280](我相信是很美美的装)\n[02:28.410]我摇晃在舞池中央\n[02:30.920](那种体态可以想象)\n[02:34.020]我做我的改变 又何必纠结\n[02:38.410]那就拜托别和我碰面\n[02:44.070]如果再看你一眼\n[02:46.810]是否还会有感觉\n[02:49.590]当年素面朝天要多纯洁就有多纯洁\n[02:55.320]不画扮熟的眼线\n[02:58.030]不用抹匀粉底液\n[03:00.930]暴雨天 照逛街\n[03:03.690]偷笑别人花了脸\n[03:06.550]如果再看你一眼\n[03:09.460]是否还会有感觉\n[03:12.270]最真实的喜怒哀乐全都埋葬在昨天\n[03:17.850]不掺任何的表演\n[03:20.520]轰轰烈烈那几年\n[03:23.500]我怀念 别怀念\n[03:26.140]怀念也回不到从前\n[03:30.570]曾经对上的瞬间\n[03:33.250]难道是一种错觉\n[03:35.790]那些流逝了的就永远不会复现\n[03:40.950]不掺任何的表演\n[03:43.230]轰轰烈烈那几年\n[03:46.090]有遗憾的感觉 为何感觉\n[03:50.190]那消失不见的素颜\n",
            "songid": 167827,
            "url": "http://music.163.com/song/media/outer/url?id=167827.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=27646687",
            "pic": "http://p1.music.126.net/2iwn7NnfNwtdyu1enlJw_w==/83562883723773.jpg?param=300x300",
            "type": "netease",
            "title": "玫瑰花的葬礼",
            "lrc": "[00:00.00] 作曲 : 李毅杰\n[00:01.00] 作词 : 许嵩/李毅杰\n[00:26.580]离开你一百个星期\n[00:28.520]我回到了这里\n[00:29.370]寻找我们爱过的证据\n[00:31.960]没有人愿意提起\n[00:33.270]玫瑰花它的过去\n[00:34.890]今天这里的主题\n[00:36.170]我把它叫作 回忆\n[00:37.780]我知道 爱情这东西\n[00:39.530]他没什么道理\n[00:40.650]过去我和你在一起\n[00:42.330]是我太叛逆\n[00:43.640]现在只剩我自己\n[00:45.510]偷偷的想你\n[00:48.330]\n[00:49.010]玫瑰花的葬礼\n[00:51.750]埋葬关于你的回忆\n[00:54.940]感觉双手麻痹\n[00:57.300]不能自已\n[00:58.800]已拉不住你\n[01:00.360]\n[01:00.980]真的好美丽\n[01:03.540]那天的烟花雨\n[01:06.220]\n[01:06.790]我说要娶穿碎花洋裙的你\n[01:10.970]\n[01:12.410]玫瑰花的葬礼\n[01:15.330]埋葬深深爱着的你\n[01:17.830]\n[01:18.390]残朵停止呼吸\n[01:20.770]渗入大地\n[01:22.200]没人会注意\n[01:23.770]\n[01:24.320]一片小雨滴\n[01:26.950]陪着我等天明\n[01:29.630]\n[01:30.320]我用这最后一分钟怀念你\n[01:35.050]\n[01:36.920]我在夜幕笼罩的天桥上潜行\n[01:39.740]每一级阶梯\n[01:40.850]都留着你我昔日印迹\n[01:42.860]温存迷醉 吵闹清醒\n[01:45.160]都还在我的脚畔\n[01:46.280]兜兜兜兜兜转不清\n[01:48.010]没来得及把红色玫瑰递给你\n[01:50.320]爱就像是一场雨\n[01:51.760]已经离我而去\n[01:53.250]你说过\n[01:53.890]太过鲜艳的爱情 终将凋零\n[01:57.760]\n[01:59.190]玫瑰花的葬礼\n[02:02.130]埋葬关于你的回忆\n[02:05.130]感觉双手麻痹\n[02:07.510]不能自已\n[02:09.070]已拉不住你\n[02:10.940]真的好美丽\n[02:13.750]那天的烟花雨\n[02:16.870]我说要娶穿碎花洋裙的你\n[02:21.420]\n[02:22.610]玫瑰花的葬礼\n[02:25.490]埋葬深深爱着的你\n[02:28.600]残朵停止呼吸\n[02:30.970]渗入大地\n[02:32.400]没人会注意\n[02:33.970]\n[02:34.530]一片小雨滴\n[02:37.210]陪着我等天明\n[02:39.830]\n[02:40.520]我用这最后一分钟怀念你\n[02:44.910]\n[02:46.400]总是回想过去 埋怨我自己\n[02:50.330]\n[02:52.200]总是不经意间 想起了你\n[02:56.880]\n[02:57.940]现在的你 已经太遥不可及\n[03:02.310]\n[03:03.680]只能留在我记忆\n[03:09.670]玫瑰花的葬礼\n[03:12.360]埋葬关于你的回忆\n[03:15.410]感觉双手麻痹\n[03:17.790]不能自已\n[03:19.280]已拉不住你\n[03:20.770]\n[03:21.330]真的好美丽\n[03:24.010]那天的烟花雨\n[03:27.070]我说要娶穿碎花洋裙的你\n[03:31.620]\n[03:32.930]玫瑰花的葬礼\n[03:35.740]埋葬深深爱着的你\n[03:38.860]残朵停止呼吸\n[03:41.110]渗入大地\n[03:42.600]没人会注意\n[03:44.600]一片小雨滴\n[03:47.420]陪着我等天明\n[03:50.600]我用这最后一分钟怀念你\n[03:55.720]\n[03:56.650]我用这最后一分钟\n",
            "songid": 27646687,
            "url": "http://music.163.com/song/media/outer/url?id=27646687.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=167850",
            "pic": "http://p1.music.126.net/3hqcQrXZ39kDCCzV7QbZjA==/34084860473122.jpg?param=300x300",
            "type": "netease",
            "title": "庐州月",
            "lrc": "[00:00.00] 作曲 : 许嵩\n[00:01.00] 作词 : 许嵩\n[00:20.209]儿时凿壁偷了谁家的光\n[00:23.610]宿昔不梳 一苦十年寒窗\n[00:27.499]如今灯下闲读 红袖添香\n[00:31.259]半生浮名只是虚妄\n[00:35.119]三月 一路烟霞 莺飞草长\n[00:38.799]柳絮纷飞里看见了故乡\n[00:42.659]不知心上的你是否还在庐阳\n[00:47.159]一缕青丝一生珍藏\n[00:51.099]桥上的恋人入对出双\n[00:54.389]桥边红药叹夜太漫长\n[00:58.190]月也摇晃 人也彷徨\n[01:01.709]乌蓬里传来了一曲离殇\n[01:07.899]庐州月光 洒在心上\n[01:11.249]月下的你不复当年模样\n[01:15.199]太多的伤 难诉衷肠\n[01:18.819]叹一句当时只道是寻常\n[01:23.899]庐州月光 梨花雨凉\n[01:27.099]如今的你又在谁的身旁\n[01:30.788]家乡月光 深深烙在我心上\n[01:35.299]却流不出当年泪光\n[01:56.057]三月 一路烟霞 莺飞草长\n[01:59.729]柳絮纷飞里看见了故乡\n[02:03.489]不知心上的你是否还在庐阳\n[02:08.010]一缕青丝一生珍藏\n[02:12.100]桥上的恋人入对出双\n[02:15.169]桥边红药叹夜太漫长\n[02:19.700]月也摇晃 人也彷徨\n[02:22.579]乌蓬里传来了一曲离殇\n[02:28.290]庐州月光 洒在心上\n[02:32.179]月下的你不复当年模样\n[02:36.390]太多的伤 难诉衷肠\n[02:39.689]叹一句当时只道是寻常\n[02:43.499]庐州月光 梨花雨凉\n[02:47.799]如今的你又在谁的身旁\n[02:51.119]家乡月光 深深烙在我心上\n[02:55.619]却流不出当年泪光\n[03:02.000]庐州的月光 在我心上\n[03:05.419]太多的伤 难诉衷肠\n[03:09.259]如今的你在谁的身旁\n[03:12.699]我流不出当年泪光\n[03:16.690]庐州月光 洒在心上\n[03:19.699]月下的你不复当年模样\n[03:23.509]太多的伤 难诉衷肠\n[03:27.600]叹一句当时只道是寻常\n[03:31.100]庐州月光 梨花雨凉\n[03:35.190]如今的你又在谁的身旁\n[03:38.769]家乡月光 深深烙在我心上\n[03:43.529]却流不出当年泪光\n",
            "songid": 167850,
            "url": "http://music.163.com/song/media/outer/url?id=167850.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=167882",
            "pic": "http://p1.music.126.net/Md3RLH0fe2a_3dMDnfqoQg==/18590542604286213.jpg?param=300x300",
            "type": "netease",
            "title": "清明雨上",
            "lrc": "[00:00.00] 作曲 : 许嵩\n[00:01.00] 作词 : 许嵩\n[00:26.988]窗透初晓 日照西桥 云自摇\n[00:33.680]想你当年荷风微摆的衣角\n[00:40.480]木雕流金 岁月涟漪 七年前封笔\n[00:46.980]因为我今生挥毫只为你\n[00:51.997]雨打湿了眼眶 年年倚井盼归堂\n[00:59.997]最怕不觉泪已拆两行\n[01:06.580]我在人间彷徨 寻不到你的天堂\n[01:13.100]东瓶西镜放 恨不能遗忘\n[01:20.100]又是清明雨上 折菊寄到你身旁\n[01:25.978]把你最爱的歌来轻轻唱\n[01:48.190]远方有琴 愀然空灵 声声催天雨\n[01:53.460]涓涓心事说给自己听\n[01:59.660]月影憧憧 烟火几重 烛花红\n[02:05.917]红尘旧梦 梦断都成空\n[02:12.667]雨打湿了眼眶 年年倚井盼归堂\n[02:20.970]最怕不觉泪已拆两行\n[02:25.700]我在人间彷徨 寻不到你的天堂\n[02:32.297]东瓶西镜放 恨不能遗忘\n[02:38.999]又是清明雨上 折菊寄到你身旁\n[02:45.670]把你最爱的歌来轻轻唱\n[02:52.526]我在人间彷徨 寻不到你的天堂\n[02:58.406]东瓶西镜放 恨不能遗忘\n[03:05.290]又是清明雨上 折菊寄到你身旁\n[03:12.297]把你最爱的歌来轻轻唱\n[03:20.289]\n[03:24.970]\n[29:28.578]\n",
            "songid": 167882,
            "url": "http://music.163.com/song/media/outer/url?id=167882.mp3"
        },
        {
            "author": "许嵩",
            "link": "http://music.163.com/#/song?id=167885",
            "pic": "http://p1.music.126.net/Md3RLH0fe2a_3dMDnfqoQg==/18590542604286213.jpg?param=300x300",
            "type": "netease",
            "title": "城府",
            "lrc": "[00:00.00] 作曲 : 许嵩\n[00:01.00] 作词 : 许嵩\n[00:34.890]你走之后 一个夏季熬成一个秋\n[00:37.930]我的书上你的正楷眉清目秀\n[00:41.140]一字一字宣告我们和平分手\n[00:44.570]好委婉的交流 还带一点征求\n[00:48.420]你已成风 幻化的雨下错了季候\n[00:51.310]明媚的眼眸里温柔化为了乌有\n[00:54.370]一层一层院墙把你的心困守\n[00:57.870]如果没法回头 这样也没不妥\n[01:01.580]你的城府有多深\n[01:04.930]我爱的有多蠢 是我太笨\n[01:08.640]还是太认真 幻想和你过一生\n[01:15.050]你的城府有多深\n[01:18.510]我爱的有多蠢 不想再问\n[01:22.960]也无法去恨 毕竟你是我最爱的人\n[01:32.779]曾经你的眼神 看起来那么单纯\n[01:35.820]嗯 指向你干净的灵魂\n[01:39.190]什么时候开始变得满是伤痕\n[01:42.480]戴上假面也好 如果不会疼\n[01:45.980]爱情这个世界 有那么多的悖论\n[01:49.170]小心翼翼不见得就会获得满分\n[01:52.529]我们之间缺少了那么多信任\n[01:55.790]最后还是没有 打开那扇心门\n[01:59.780]你的城府有多深\n[02:03.040]我爱的有多蠢 是我太笨\n[02:07.150]还是太认真 幻想和你过一生\n[02:13.100]你的城府有多深\n[02:16.540]我爱的有多蠢 不想再问\n[02:21.100]也无法去恨 毕竟你是我最爱的人\n[02:30.060]我曾经苦笑着问过我自己\n[02:36.940]在某个夜里 卸下伪装的你\n[02:39.800]是不是也会哭泣\n[02:43.710]你的城府有多深\n[02:47.090]我爱的有多蠢 是我太笨\n[02:51.200]还是太认真 幻想和你过一生\n[02:57.240]你的城府有多深\n[03:00.590]我爱的有多蠢 不想再问\n[03:05.030]也无法去恨 毕竟你是爱过我的人\n",
            "songid": 167885,
            "url": "http://music.163.com/song/media/outer/url?id=167885.mp3"
        }
    ]
};
const expressList = [{
    "com": "jd",
    "name": "京东"
}, {
    "com": "youzhengguonei",
    "name": "邮政"
}, {
    "com": "shentong",
    "name": "申通"
}, {
    "com": "ems",
    "name": "EMS"
}, {
    "com": "shunfeng",
    "name": "顺丰"
}, {
    "com": "yuantong",
    "name": "圆通"
}, {
    "com": "zhongtong",
    "name": "中通"
}, {
    "com": "yunda",
    "name": "韵达"
}, {
    "com": "tiantian",
    "name": "天天"
}, {
    "com": "huitongkuaidi",
    "name": "汇通"
}, {
    "com": "quanfengkuaidi",
    "name": "全峰"
}, {
    "com": "debangwuliu",
    "name": "德邦"
}, {
    "com": "zhaijisong",
    "name": "宅急送"
}];

const cityList = [

    {
        "name": "北京",
        "city": [{
            "name": "北京",
            "area": ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "平谷区", "怀柔区", "密云县", "延庆县"]
        }]
    },

    {
        "name": "天津",
        "city": [{
            "name": "天津",
            "area": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟  县"]
        }]
    },

    {
        "name": "河北",
        "city": [

            {
                "name": "石家庄",
                "area": ["长安区", "桥东区", "桥西区", "新华区", "郊  区", "井陉矿区", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵  县", "辛集市", "藁", "晋州市", "新乐市", "鹿泉市"]
            },

            {
                "name": "唐山",
                "area": ["路南区", "路北区", "古冶区", "开平区", "新  区", "丰润县", "滦  县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县", "遵化市", "丰南市", "迁安市"]
            },

            {
                "name": "秦皇岛",
                "area": ["海港区", "山海关区", "北戴河区", "青龙满族自治县", "昌黎县", "抚宁县", "卢龙县"]
            },

            {
                "name": "邯郸",
                "area": ["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县", "涉  县", "磁  县", "肥乡县", "永年县", "邱  县", "鸡泽县", "广平县", "馆陶县", "魏  县", "曲周县", "武安市"]
            },

            {
                "name": "邢台",
                "area": ["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任  县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威  县", "清河县", "临西县", "南宫市", "沙河市"]
            },

            {
                "name": "保定",
                "area": ["新市区", "北市区", "南市区", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐  县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易  县", "曲阳县", "蠡  县", "顺平县", "博野", "雄县", "涿州市", "定州市", "安国市", "高碑店市"]
            },

            {
                "name": "张家口",
                "area": ["桥东区", "桥西区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚  县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"]
            },

            {
                "name": "承德",
                "area": ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"]
            },

            {
                "name": "沧州",
                "area": ["新华区", "运河区", "沧  县", "青  县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献  县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市"]
            },

            {
                "name": "廊坊",
                "area": ["安次区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市"]
            },

            {
                "name": "衡水",
                "area": ["桃城区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景  县", "阜城县", "冀州市", "深州市"]
            }

        ]
    },

    {
        "name": "山西",
        "city": [

            {
                "name": "太原",
                "area": ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"]
            },

            {
                "name": "大同",
                "area": ["城  区", "矿  区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"]
            },

            {
                "name": "阳泉",
                "area": ["城  区", "矿  区", "郊  区", "平定县", "盂  县"]
            },

            {
                "name": "长治",
                "area": ["城  区", "郊  区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁  县", "沁源县", "潞城市"]
            },

            {
                "name": "晋城",
                "area": ["城  区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"]
            },

            {
                "name": "朔州",
                "area": ["朔城区", "平鲁区", "山阴县", "应  县", "右玉县", "怀仁县"]
            },

            {
                "name": "忻州",
                "area": ["忻府区", "原平市", "定襄县", "五台县", "代  县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县"]
            },

            {
                "name": "吕梁",
                "area": ["离石区", "孝义市", "汾阳市", "文水县", "交城县", "兴  县", "临  县", "柳林县", "石楼县", "岚  县", "方山县", "中阳县", "交口县"]
            },

            {
                "name": "晋中",
                "area": ["榆次市", "介休市", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁  县", "平遥县", "灵石县"]
            },

            {
                "name": "临汾",
                "area": ["临汾市", "侯马市", "霍州市", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古  县", "安泽县", "浮山县", "吉  县", "乡宁县", "蒲  县", "大宁县", "永和县", "隰  县", "汾西县"]
            },

            {
                "name": "运城",
                "area": ["运城市", "永济市", "河津市", "芮城县", "临猗县", "万荣县", "新绛县", "稷山县", "闻喜县", "夏  县", "绛  县", "平陆县", "垣曲县"]
            }

        ]
    },

    {
        "name": "内蒙古",
        "city": [

            {
                "name": "呼和浩特",
                "area": ["新城区", "回民区", "玉泉区", "郊  区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"]
            },

            {
                "name": "包头",
                "area": ["东河区", "昆都伦区", "青山区", "石拐矿区", "白云矿区", "郊  区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"]
            },

            {
                "name": "乌海",
                "area": ["海勃湾区", "海南区", "乌达区"]
            },

            {
                "name": "赤峰",
                "area": ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"]
            },

            {
                "name": "呼伦贝尔",
                "area": ["海拉尔市", "满洲里市", "扎兰屯市", "牙克石市", "根河市", "额尔古纳市", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "新巴尔虎右旗", "新巴尔虎左旗", "陈巴尔虎旗"]
            },

            {
                "name": "兴安盟",
                "area": ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"]
            },

            {
                "name": "通辽",
                "area": ["科尔沁区", "霍林郭勒市", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗"]
            },

            {
                "name": "锡林郭勒盟",
                "area": ["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县"]
            },

            {
                "name": "乌兰察布盟",
                "area": ["集宁市", "丰镇市", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗"]
            },

            {
                "name": "伊克昭盟",
                "area": ["东胜市", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"]
            },

            {
                "name": "巴彦淖尔盟",
                "area": ["临河市", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"]
            },

            {
                "name": "阿拉善盟",
                "area": ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]
            }

        ]
    },

    {
        "name": "辽宁",
        "city": [

            {
                "name": "沈阳",
                "area": ["沈河区", "皇姑区", "和平区", "大东区", "铁西区", "苏家屯区", "东陵区", "于洪区", "新民市", "法库县", "辽中县", "康平县", "新城子区", "其他"]
            },

            {
                "name": "大连",
                "area": ["西岗区", "中山区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "瓦房店市", "普兰店市", "庄河市", "长海县", "其他"]
            },

            {
                "name": "鞍山",
                "area": ["铁东区", "铁西区", "立山区", "千山区", "海城市", "台安县", "岫岩满族自治县", "其他"]
            },

            {
                "name": "抚顺",
                "area": ["顺城区", "新抚区", "东洲区", "望花区", "抚顺县", "清原满族自治县", "新宾满族自治县", "其他"]
            },

            {
                "name": "本溪",
                "area": ["平山区", "明山区", "溪湖区", "南芬区", "本溪满族自治县", "桓仁满族自治县", "其他"]
            },

            {
                "name": "丹东",
                "area": ["振兴区", "元宝区", "振安区", "东港市", "凤城市", "宽甸满族自治县", "其他"]
            },

            {
                "name": "锦州",
                "area": ["太和区", "古塔区", "凌河区", "凌海市", "黑山县", "义县", "北宁市", "其他"]
            },

            {
                "name": "营口",
                "area": ["站前区", "西市区", "鲅鱼圈区", "老边区", "大石桥市", "盖州市", "其他"]
            },

            {
                "name": "阜新",
                "area": ["海州区", "新邱区", "太平区", "清河门区", "细河区", "彰武县", "阜新蒙古族自治县", "其他"]
            },

            {
                "name": "辽阳",
                "area": ["白塔区", "文圣区", "宏伟区", "太子河区", "弓长岭区", "灯塔市", "辽阳县", "其他"]
            },

            {
                "name": "盘锦",
                "area": ["双台子区", "兴隆台区", "盘山县", "大洼县", "其他"]
            },

            {
                "name": "铁岭",
                "area": ["银州区", "清河区", "调兵山市", "开原市", "铁岭县", "昌图县", "西丰县", "其他"]
            },

            {
                "name": "朝阳",
                "area": ["双塔区", "龙城区", "凌源市", "北票市", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "其他"]
            },

            {
                "name": "葫芦岛",
                "area": ["龙港区", "南票区", "连山区", "兴城市", "绥中县", "建昌县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "吉林",
        "city": [

            {
                "name": "长春",
                "area": ["朝阳区", "宽城区", "二道区", "南关区", "绿园区", "双阳区", "九台市", "榆树市", "德惠市", "农安县", "其他"]
            },

            {
                "name": "吉林",
                "area": ["船营区", "昌邑区", "龙潭区", "丰满区", "舒兰市", "桦甸市", "蛟河市", "磐石市", "永吉县", "其他"]
            },

            {
                "name": "四平",
                "area": ["铁西区", "铁东区", "公主岭市", "双辽市", "梨树县", "伊通满族自治县", "其他"]
            },

            {
                "name": "辽源",
                "area": ["龙山区", "西安区", "东辽县", "东丰县", "其他"]
            },

            {
                "name": "通化",
                "area": ["东昌区", "二道江区", "梅河口市", "集安市", "通化县", "辉南县", "柳河县", "其他"]
            },

            {
                "name": "白山",
                "area": ["八道江区", "江源区", "临江市", "靖宇县", "抚松县", "长白朝鲜族自治县", "其他"]
            },

            {
                "name": "松原",
                "area": ["宁江区", "乾安县", "长岭县", "扶余县", "前郭尔罗斯蒙古族自治县", "其他"]
            },

            {
                "name": "白城",
                "area": ["洮北区", "大安市", "洮南市", "镇赉县", "通榆县", "其他"]
            },

            {
                "name": "延边朝鲜族自治州",
                "area": ["延吉市", "图们市", "敦化市", "龙井市", "珲春市", "和龙市", "安图县", "汪清县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "黑龙江",
        "city": [

            {
                "name": "哈尔滨",
                "area": ["松北区", "道里区", "南岗区", "平房区", "香坊区", "道外区", "呼兰区", "阿城区", "双城市", "尚志市", "五常市", "宾县", "方正县", "通河县", "巴彦县", "延寿县", "木兰县", "依兰县", "其他"]
            },

            {
                "name": "齐齐哈尔",
                "area": ["龙沙区", "昂昂溪区", "铁锋区", "建华区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "讷河市", "富裕县", "拜泉县", "甘南县", "依安县", "克山县", "泰来县", "克东县", "龙江县", "其他"]
            },

            {
                "name": "鹤岗",
                "area": ["兴山区", "工农区", "南山区", "兴安区", "向阳区", "东山区", "萝北县", "绥滨县", "其他"]
            },

            {
                "name": "双鸭山",
                "area": ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "宝清县", "友谊县", "饶河县", "其他"]
            },

            {
                "name": "鸡西",
                "area": ["鸡冠区", "恒山区", "城子河区", "滴道区", "梨树区", "麻山区", "密山市", "虎林市", "鸡东县", "其他"]
            },

            {
                "name": "大庆",
                "area": ["萨尔图区", "红岗区", "龙凤区", "让胡路区", "大同区", "林甸县", "肇州县", "肇源县", "杜尔伯特蒙古族自治县", "其他"]
            },

            {
                "name": "伊春",
                "area": ["伊春区", "带岭区", "南岔区", "金山屯区", "西林区", "美溪区", "乌马河区", "翠峦区", "友好区", "上甘岭区", "五营区", "红星区", "新青区", "汤旺河区", "乌伊岭区", "铁力市", "嘉荫县", "其他"]
            },

            {
                "name": "牡丹江",
                "area": ["爱民区", "东安区", "阳明区", "西安区", "绥芬河市", "宁安市", "海林市", "穆棱市", "林口县", "东宁县", "其他"]
            },

            {
                "name": "佳木斯",
                "area": ["向阳区", "前进区", "东风区", "郊区", "同江市", "富锦市", "桦川县", "抚远县", "桦南县", "汤原县", "其他"]
            },

            {
                "name": "七台河",
                "area": ["桃山区", "新兴区", "茄子河区", "勃利县", "其他"]
            },

            {
                "name": "黑河",
                "area": ["爱辉区", "北安市", "五大连池市", "逊克县", "嫩江县", "孙吴县", "其他"]
            },

            {
                "name": "绥化",
                "area": ["北林区", "安达市", "肇东市", "海伦市", "绥棱县", "兰西县", "明水县", "青冈县", "庆安县", "望奎县", "其他"]
            },

            {
                "name": "大兴安岭地区",
                "area": ["呼玛县", "塔河县", "漠河县", "大兴安岭辖区", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "上海",
        "city": [

            {
                "name": "上海",
                "area": ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "宝山区", "闵行区", "嘉定区", "松江区", "金山区", "青浦区", "南汇区", "奉贤区", "浦东新区", "崇明县", "其他"]
            }

        ]
    },

    {
        "name": "江苏",
        "city": [

            {
                "name": "南京",
                "area": ["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "栖霞区", "雨花台区", "浦口区", "江宁区", "六合区", "溧水县", "高淳县", "其他"]
            },

            {
                "name": "苏州",
                "area": ["金阊区", "平江区", "沧浪区", "虎丘区", "吴中区", "相城区", "常熟市", "张家港市", "昆山市", "吴江市", "太仓市", "其他"]
            },

            {
                "name": "无锡",
                "area": ["崇安区", "南长区", "北塘区", "滨湖区", "锡山区", "惠山区", "江阴市", "宜兴市", "其他"]
            },

            {
                "name": "常州",
                "area": ["钟楼区", "天宁区", "戚墅堰区", "新北区", "武进区", "金坛市", "溧阳市", "其他"]
            },

            {
                "name": "镇江",
                "area": ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市", "其他"]
            },

            {
                "name": "南通",
                "area": ["崇川区", "港闸区", "通州市", "如皋市", "海门市", "启东市", "海安县", "如东县", "其他"]
            },

            {
                "name": "泰州",
                "area": ["海陵区", "高港区", "姜堰市", "泰兴市", "靖江市", "兴化市", "其他"]
            },

            {
                "name": "扬州",
                "area": ["广陵区", "维扬区", "邗江区", "江都市", "仪征市", "高邮市", "宝应县", "其他"]
            },

            {
                "name": "盐城",
                "area": ["亭湖区", "盐都区", "大丰市", "东台市", "建湖县", "射阳县", "阜宁县", "滨海县", "响水县", "其他"]
            },

            {
                "name": "连云港",
                "area": ["新浦区", "海州区", "连云区", "东海县", "灌云县", "赣榆县", "灌南县", "其他"]
            },

            {
                "name": "徐州",
                "area": ["云龙区", "鼓楼区", "九里区", "泉山区", "贾汪区", "邳州市", "新沂市", "铜山县", "睢宁县", "沛县", "丰县", "其他"]
            },

            {
                "name": "淮安",
                "area": ["清河区", "清浦区", "楚州区", "淮阴区", "涟水县", "洪泽县", "金湖县", "盱眙县", "其他"]
            },

            {
                "name": "宿迁",
                "area": ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "浙江",
        "city": [

            {
                "name": "杭州",
                "area": ["拱墅区", "西湖区", "上城区", "下城区", "江干区", "滨江区", "余杭区", "萧山区", "建德市", "富阳市", "临安市", "桐庐县", "淳安县", "其他"]
            },

            {
                "name": "宁波",
                "area": ["海曙区", "江东区", "江北区", "镇海区", "北仑区", "鄞州区", "余姚市", "慈溪市", "奉化市", "宁海县", "象山县", "其他"]
            },

            {
                "name": "温州",
                "area": ["鹿城区", "龙湾区", "瓯海区", "瑞安市", "乐清市", "永嘉县", "洞头县", "平阳县", "苍南县", "文成县", "泰顺县", "其他"]
            },

            {
                "name": "嘉兴",
                "area": ["秀城区", "秀洲区", "海宁市", "平湖市", "桐乡市", "嘉善县", "海盐县", "其他"]
            },

            {
                "name": "湖州",
                "area": ["吴兴区", "南浔区", "长兴县", "德清县", "安吉县", "其他"]
            },

            {
                "name": "绍兴",
                "area": ["越城区", "诸暨市", "上虞市", "嵊州市", "绍兴县", "新昌县", "其他"]
            },

            {
                "name": "金华",
                "area": ["婺城区", "金东区", "兰溪市", "义乌市", "东阳市", "永康市", "武义县", "浦江县", "磐安县", "其他"]
            },

            {
                "name": "衢州",
                "area": ["柯城区", "衢江区", "江山市", "龙游县", "常山县", "开化县", "其他"]
            },

            {
                "name": "舟山",
                "area": ["定海区", "普陀区", "岱山县", "嵊泗县", "其他"]
            },

            {
                "name": "台州",
                "area": ["椒江区", "黄岩区", "路桥区", "临海市", "温岭市", "玉环县", "天台县", "仙居县", "三门县", "其他"]
            },

            {
                "name": "丽水",
                "area": ["莲都区", "龙泉市", "缙云县", "青田县", "云和县", "遂昌县", "松阳县", "庆元县", "景宁畲族自治县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "安徽",
        "city": [

            {
                "name": "合肥",
                "area": ["庐阳区", "瑶海区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县", "其他"]
            },

            {
                "name": "芜湖",
                "area": ["镜湖区", "弋江区", "鸠江区", "三山区", "芜湖县", "南陵县", "繁昌县", "其他"]
            },

            {
                "name": "蚌埠",
                "area": ["蚌山区", "龙子湖区", "禹会区", "淮上区", "怀远县", "固镇县", "五河县", "其他"]
            },

            {
                "name": "淮南",
                "area": ["田家庵区", "大通区", "谢家集区", "八公山区", "潘集区", "凤台县", "其他"]
            },

            {
                "name": "马鞍山",
                "area": ["雨山区", "花山区", "金家庄区", "当涂县", "其他"]
            },

            {
                "name": "淮北",
                "area": ["相山区", "杜集区", "烈山区", "濉溪县", "其他"]
            },

            {
                "name": "铜陵",
                "area": ["铜官山区", "狮子山区", "郊区", "铜陵县", "其他"]
            },

            {
                "name": "安庆",
                "area": ["迎江区", "大观区", "宜秀区", "桐城市", "宿松县", "枞阳县", "太湖县", "怀宁县", "岳西县", "望江县", "潜山县", "其他"]
            },

            {
                "name": "黄山",
                "area": ["屯溪区", "黄山区", "徽州区", "休宁县", "歙县", "祁门县", "黟县", "其他"]
            },

            {
                "name": "滁州",
                "area": ["琅琊区", "南谯区", "天长市", "明光市", "全椒县", "来安县", "定远县", "凤阳县", "其他"]
            },

            {
                "name": "阜阳",
                "area": ["颍州区", "颍东区", "颍泉区", "界首市", "临泉县", "颍上县", "阜南县", "太和县", "其他"]
            },

            {
                "name": "宿州",
                "area": ["埇桥区", "萧县", "泗县", "砀山县", "灵璧县", "其他"]
            },

            {
                "name": "巢湖",
                "area": ["居巢区", "含山县", "无为县", "庐江县", "和县", "其他"]
            },

            {
                "name": "六安",
                "area": ["金安区", "裕安区", "寿县", "霍山县", "霍邱县", "舒城县", "金寨县", "其他"]
            },

            {
                "name": "亳州",
                "area": ["谯城区", "利辛县", "涡阳县", "蒙城县", "其他"]
            },

            {
                "name": "池州",
                "area": ["贵池区", "东至县", "石台县", "青阳县", "其他"]
            },

            {
                "name": "宣城",
                "area": ["宣州区", "宁国市", "广德县", "郎溪县", "泾县", "旌德县", "绩溪县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "福建",
        "city": [

            {
                "name": "福州",
                "area": ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "福清市", "长乐市", "闽侯县", "闽清县", "永泰县", "连江县", "罗源县", "平潭县", "其他"]
            },

            {
                "name": "厦门",
                "area": ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区", "其他"]
            },

            {
                "name": "莆田",
                "area": ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县", "其他"]
            },

            {
                "name": "三明",
                "area": ["梅列区", "三元区", "永安市", "明溪县", "将乐县", "大田县", "宁化县", "建宁县", "沙县", "尤溪县", "清流县", "泰宁县", "其他"]
            },

            {
                "name": "泉州",
                "area": ["鲤城区", "丰泽区", "洛江区", "泉港区", "石狮市", "晋江市", "南安市", "惠安县", "永春县", "安溪县", "德化县", "金门县", "其他"]
            },

            {
                "name": "漳州",
                "area": ["芗城区", "龙文区", "龙海市", "平和县", "南靖县", "诏安县", "漳浦县", "华安县", "东山县", "长泰县", "云霄县", "其他"]
            },

            {
                "name": "南平",
                "area": ["延平区", "建瓯市", "邵武市", "武夷山市", "建阳市", "松溪县", "光泽县", "顺昌县", "浦城县", "政和县", "其他"]
            },

            {
                "name": "龙岩",
                "area": ["新罗区", "漳平市", "长汀县", "武平县", "上杭县", "永定县", "连城县", "其他"]
            },

            {
                "name": "宁德",
                "area": ["蕉城区", "福安市", "福鼎市", "寿宁县", "霞浦县", "柘荣县", "屏南县", "古田县", "周宁县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "江西",
        "city": [

            {
                "name": "南昌",
                "area": ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "新建县", "南昌县", "进贤县", "安义县", "其他"]
            },

            {
                "name": "景德镇",
                "area": ["珠山区", "昌江区", "乐平市", "浮梁县", "其他"]
            },

            {
                "name": "萍乡",
                "area": ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县", "其他"]
            },

            {
                "name": "九江",
                "area": ["浔阳区", "庐山区", "瑞昌市", "九江县", "星子县", "武宁县", "彭泽县", "永修县", "修水县", "湖口县", "德安县", "都昌县", "其他"]
            },

            {
                "name": "新余",
                "area": ["渝水区", "分宜县", "其他"]
            },

            {
                "name": "鹰潭",
                "area": ["月湖区", "贵溪市", "余江县", "其他"]
            },

            {
                "name": "赣州",
                "area": ["章贡区", "瑞金市", "南康市", "石城县", "安远县", "赣县", "宁都县", "寻乌县", "兴国县", "定南县", "上犹县", "于都县", "龙南县", "崇义县", "信丰县", "全南县", "大余县", "会昌县", "其他"]
            },

            {
                "name": "吉安",
                "area": ["吉州区", "青原区", "井冈山市", "吉安县", "永丰县", "永新县", "新干县", "泰和县", "峡江县", "遂川县", "安福县", "吉水县", "万安县", "其他"]
            },

            {
                "name": "宜春",
                "area": ["袁州区", "丰城市", "樟树市", "高安市", "铜鼓县", "靖安县", "宜丰县", "奉新县", "万载县", "上高县", "其他"]
            },

            {
                "name": "抚州",
                "area": ["临川区", "南丰县", "乐安县", "金溪县", "南城县", "东乡县", "资溪县", "宜黄县", "广昌县", "黎川县", "崇仁县", "其他"]
            },

            {
                "name": "上饶",
                "area": ["信州区", "德兴市", "上饶县", "广丰县", "鄱阳县", "婺源县", "铅山县", "余干县", "横峰县", "弋阳县", "玉山县", "万年县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "山东",
        "city": [

            {
                "name": "济南",
                "area": ["市中区", "历下区", "天桥区", "槐荫区", "历城区", "长清区", "章丘市", "平阴县", "济阳县", "商河县", "其他"]
            },

            {
                "name": "青岛",
                "area": ["市南区", "市北区", "城阳区", "四方区", "李沧区", "黄岛区", "崂山区", "胶南市", "胶州市", "平度市", "莱西市", "即墨市", "其他"]
            },

            {
                "name": "淄博",
                "area": ["张店区", "临淄区", "淄川区", "博山区", "周村区", "桓台县", "高青县", "沂源县", "其他"]
            },

            {
                "name": "枣庄",
                "area": ["市中区", "山亭区", "峄城区", "台儿庄区", "薛城区", "滕州市", "其他"]
            },

            {
                "name": "东营",
                "area": ["东营区", "河口区", "垦利县", "广饶县", "利津县", "其他"]
            },

            {
                "name": "烟台",
                "area": ["芝罘区", "福山区", "牟平区", "莱山区", "龙口市", "莱阳市", "莱州市", "招远市", "蓬莱市", "栖霞市", "海阳市", "长岛县", "其他"]
            },

            {
                "name": "潍坊",
                "area": ["潍城区", "寒亭区", "坊子区", "奎文区", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市", "昌乐县", "临朐县", "其他"]
            },

            {
                "name": "济宁",
                "area": ["市中区", "任城区", "曲阜市", "兖州市", "邹城市", "鱼台县", "金乡县", "嘉祥县", "微山县", "汶上县", "泗水县", "梁山县", "其他"]
            },

            {
                "name": "泰安",
                "area": ["泰山区", "岱岳区", "新泰市", "肥城市", "宁阳县", "东平县", "其他"]
            },

            {
                "name": "威海",
                "area": ["环翠区", "乳山市", "文登市", "荣成市", "其他"]
            },

            {
                "name": "日照",
                "area": ["东港区", "岚山区", "五莲县", "莒县", "其他"]
            },

            {
                "name": "莱芜",
                "area": ["莱城区", "钢城区", "其他"]
            },

            {
                "name": "临沂",
                "area": ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县", "其他"]
            },

            {
                "name": "德州",
                "area": ["德城区", "乐陵市", "禹城市", "陵县", "宁津县", "齐河县", "武城县", "庆云县", "平原县", "夏津县", "临邑县", "其他"]
            },

            {
                "name": "聊城",
                "area": ["东昌府区", "临清市", "高唐县", "阳谷县", "茌平县", "莘县", "东阿县", "冠县", "其他"]
            },

            {
                "name": "滨州",
                "area": ["滨城区", "邹平县", "沾化县", "惠民县", "博兴县", "阳信县", "无棣县", "其他"]
            },

            {
                "name": "菏泽",
                "area": ["牡丹区", "鄄城县", "单县", "郓城县", "曹县", "定陶县", "巨野县", "东明县", "成武县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "河南",
        "city": [

            {
                "name": "郑州",
                "area": ["中原区", "金水区", "二七区", "管城回族区", "上街区", "惠济区", "巩义市", "新郑市", "新密市", "登封市", "荥阳市", "中牟县", "其他"]
            },

            {
                "name": "开封",
                "area": ["鼓楼区", "龙亭区", "顺河回族区", "禹王台区", "金明区", "开封县", "尉氏县", "兰考县", "杞县", "通许县", "其他"]
            },

            {
                "name": "洛阳",
                "area": ["西工区", "老城区", "涧西区", "瀍河回族区", "洛龙区", "吉利区", "偃师市", "孟津县", "汝阳县", "伊川县", "洛宁县", "嵩县", "宜阳县", "新安县", "栾川县", "其他"]
            },

            {
                "name": "平顶山",
                "area": ["新华区", "卫东区", "湛河区", "石龙区", "汝州市", "舞钢市", "宝丰县", "叶县", "郏县", "鲁山县", "其他"]
            },

            {
                "name": "安阳",
                "area": ["北关区", "文峰区", "殷都区", "龙安区", "林州市", "安阳县", "滑县", "内黄县", "汤阴县", "其他"]
            },

            {
                "name": "鹤壁",
                "area": ["淇滨区", "山城区", "鹤山区", "浚县", "淇县", "其他"]
            },

            {
                "name": "新乡",
                "area": ["卫滨区", "红旗区", "凤泉区", "牧野区", "卫辉市", "辉县市", "新乡县", "获嘉县", "原阳县", "长垣县", "封丘县", "延津县", "其他"]
            },

            {
                "name": "焦作",
                "area": ["解放区", "中站区", "马村区", "山阳区", "沁阳市", "孟州市", "修武县", "温县", "武陟县", "博爱县", "其他"]
            },

            {
                "name": "濮阳",
                "area": ["华龙区", "濮阳县", "南乐县", "台前县", "清丰县", "范县", "其他"]
            },

            {
                "name": "许昌",
                "area": ["魏都区", "禹州市", "长葛市", "许昌县", "鄢陵县", "襄城县", "其他"]
            },

            {
                "name": "漯河",
                "area": ["源汇区", "郾城区", "召陵区", "临颍县", "舞阳县", "其他"]
            },

            {
                "name": "三门峡",
                "area": ["湖滨区", "义马市", "灵宝市", "渑池县", "卢氏县", "陕县", "其他"]
            },

            {
                "name": "南阳",
                "area": ["卧龙区", "宛城区", "邓州市", "桐柏县", "方城县", "淅川县", "镇平县", "唐河县", "南召县", "内乡县", "新野县", "社旗县", "西峡县", "其他"]
            },

            {
                "name": "商丘",
                "area": ["梁园区", "睢阳区", "永城市", "宁陵县", "虞城县", "民权县", "夏邑县", "柘城县", "睢县", "其他"]
            },

            {
                "name": "信阳",
                "area": ["浉河区", "平桥区", "潢川县", "淮滨县", "息县", "新县", "商城县", "固始县", "罗山县", "光山县", "其他"]
            },

            {
                "name": "周口",
                "area": ["川汇区", "项城市", "商水县", "淮阳县", "太康县", "鹿邑县", "西华县", "扶沟县", "沈丘县", "郸城县", "其他"]
            },

            {
                "name": "驻马店",
                "area": ["驿城区", "确山县", "新蔡县", "上蔡县", "西平县", "泌阳县", "平舆县", "汝南县", "遂平县", "正阳县", "其他"]
            },

            {
                "name": "焦作",
                "area": ["济源市", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "湖北",
        "city": [

            {
                "name": "武汉",
                "area": ["江岸区", "武昌区", "江汉区", "硚口区", "汉阳区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区", "其他"]
            },

            {
                "name": "黄石",
                "area": ["黄石港区", "西塞山区", "下陆区", "铁山区", "大冶市", "阳新县", "其他"]
            },

            {
                "name": "十堰",
                "area": ["张湾区", "茅箭区", "丹江口市", "郧县", "竹山县", "房县", "郧西县", "竹溪县", "其他"]
            },

            {
                "name": "荆州",
                "area": ["沙市区", "荆州区", "洪湖市", "石首市", "松滋市", "监利县", "公安县", "江陵县", "其他"]
            },

            {
                "name": "宜昌",
                "area": ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "宜都市", "当阳市", "枝江市", "秭归县", "远安县", "兴山县", "五峰土家族自治县", "长阳土家族自治县", "其他"]
            },

            {
                "name": "襄樊",
                "area": ["襄城区", "樊城区", "襄阳区", "老河口市", "枣阳市", "宜城市", "南漳县", "谷城县", "保康县", "其他"]
            },

            {
                "name": "鄂州",
                "area": ["鄂城区", "华容区", "梁子湖区", "其他"]
            },

            {
                "name": "荆门",
                "area": ["东宝区", "掇刀区", "钟祥市", "京山县", "沙洋县", "其他"]
            },

            {
                "name": "孝感",
                "area": ["孝南区", "应城市", "安陆市", "汉川市", "云梦县", "大悟县", "孝昌县", "其他"]
            },

            {
                "name": "黄冈",
                "area": ["黄州区", "麻城市", "武穴市", "红安县", "罗田县", "浠水县", "蕲春县", "黄梅县", "英山县", "团风县", "其他"]
            },

            {
                "name": "咸宁",
                "area": ["咸安区", "赤壁市", "嘉鱼县", "通山县", "崇阳县", "通城县", "其他"]
            },

            {
                "name": "随州",
                "area": ["曾都区", "广水市", "其他"]
            },

            {
                "name": "恩施土家族苗族自治州",
                "area": ["恩施市", "利川市", "建始县", "来凤县", "巴东县", "鹤峰县", "宣恩县", "咸丰县", "其他"]
            },

            {
                "name": "仙桃",
                "area": ["仙桃"]
            },

            {
                "name": "天门",
                "area": ["天门"]
            },

            {
                "name": "潜江",
                "area": ["潜江"]
            },

            {
                "name": "神农架林区",
                "area": ["神农架林区"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "湖南",
        "city": [

            {
                "name": "长沙",
                "area": ["岳麓区", "芙蓉区", "天心区", "开福区", "雨花区", "浏阳市", "长沙县", "望城县", "宁乡县", "其他"]
            },

            {
                "name": "株洲",
                "area": ["天元区", "荷塘区", "芦淞区", "石峰区", "醴陵市", "株洲县", "炎陵县", "茶陵县", "攸县", "其他"]
            },

            {
                "name": "湘潭",
                "area": ["岳塘区", "雨湖区", "湘乡市", "韶山市", "湘潭县", "其他"]
            },

            {
                "name": "衡阳",
                "area": ["雁峰区", "珠晖区", "石鼓区", "蒸湘区", "南岳区", "耒阳市", "常宁市", "衡阳县", "衡东县", "衡山县", "衡南县", "祁东县", "其他"]
            },

            {
                "name": "邵阳",
                "area": ["双清区", "大祥区", "北塔区", "武冈市", "邵东县", "洞口县", "新邵县", "绥宁县", "新宁县", "邵阳县", "隆回县", "城步苗族自治县", "其他"]
            },

            {
                "name": "岳阳",
                "area": ["岳阳楼区", "云溪区", "君山区", "临湘市", "汨罗市", "岳阳县", "湘阴县", "平江县", "华容县", "其他"]
            },

            {
                "name": "常德",
                "area": ["武陵区", "鼎城区", "津市市", "澧县", "临澧县", "桃源县", "汉寿县", "安乡县", "石门县", "其他"]
            },

            {
                "name": "张家界",
                "area": ["永定区", "武陵源区", "慈利县", "桑植县", "其他"]
            },

            {
                "name": "益阳",
                "area": ["赫山区", "资阳区", "沅江市", "桃江县", "南县", "安化县", "其他"]
            },

            {
                "name": "郴州",
                "area": ["北湖区", "苏仙区", "资兴市", "宜章县", "汝城县", "安仁县", "嘉禾县", "临武县", "桂东县", "永兴县", "桂阳县", "其他"]
            },

            {
                "name": "永州",
                "area": ["冷水滩区", "零陵区", "祁阳县", "蓝山县", "宁远县", "新田县", "东安县", "江永县", "道县", "双牌县", "江华瑶族自治县", "其他"]
            },

            {
                "name": "怀化",
                "area": ["鹤城区", "洪江市", "会同县", "沅陵县", "辰溪县", "溆浦县", "中方县", "新晃侗族自治县", "芷江侗族自治县", "通道侗族自治县", "靖州苗族侗族自治县", "麻阳苗族自治县", "其他"]
            },

            {
                "name": "娄底",
                "area": ["娄星区", "冷水江市", "涟源市", "新化县", "双峰县", "其他"]
            },

            {
                "name": "湘西土家族苗族自治州",
                "area": ["吉首市", "古丈县", "龙山县", "永顺县", "凤凰县", "泸溪县", "保靖县", "花垣县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "广东",
        "city": [

            {
                "name": "广州",
                "area": ["越秀区", "荔湾区", "海珠区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "萝岗区", "增城市", "从化市", "其他"]
            },

            {
                "name": "深圳",
                "area": ["福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "盐田区", "其他"]
            },

            {
                "name": "东莞",
                "area": ["莞城", "常平", "塘厦", "塘厦", "塘厦", "其他"]
            },

            {
                "name": "中山",
                "area": ["中山"]
            },

            {
                "name": "潮州",
                "area": ["湘桥区", "潮安县", "饶平县", "其他"]
            },

            {
                "name": "揭阳",
                "area": ["榕城区", "揭东县", "揭西县", "惠来县", "普宁市", "其他"]
            },

            {
                "name": "云浮",
                "area": ["云城区", "新兴县", "郁南县", "云安县", "罗定市", "其他"]
            },

            {
                "name": "珠海",
                "area": ["香洲区", "斗门区", "金湾区", "其他"]
            },

            {
                "name": "汕头",
                "area": ["金平区", "濠江区", "龙湖区", "潮阳区", "潮南区", "澄海区", "南澳县", "其他"]
            },

            {
                "name": "韶关",
                "area": ["浈江区", "武江区", "曲江区", "乐昌市", "南雄市", "始兴县", "仁化县", "翁源县", "新丰县", "乳源瑶族自治县", "其他"]
            },

            {
                "name": "佛山",
                "area": ["禅城区", "南海区", "顺德区", "三水区", "高明区", "其他"]
            },

            {
                "name": "江门",
                "area": ["蓬江区", "江海区", "新会区", "恩平市", "台山市", "开平市", "鹤山市", "其他"]
            },

            {
                "name": "湛江",
                "area": ["赤坎区", "霞山区", "坡头区", "麻章区", "吴川市", "廉江市", "雷州市", "遂溪县", "徐闻县", "其他"]
            },

            {
                "name": "茂名",
                "area": ["茂南区", "茂港区", "化州市", "信宜市", "高州市", "电白县", "其他"]
            },

            {
                "name": "肇庆",
                "area": ["端州区", "鼎湖区", "高要市", "四会市", "广宁县", "怀集县", "封开县", "德庆县", "其他"]
            },

            {
                "name": "惠州",
                "area": ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县", "其他"]
            },

            {
                "name": "梅州",
                "area": ["梅江区", "兴宁市", "梅县", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "其他"]
            },

            {
                "name": "汕尾",
                "area": ["城区", "陆丰市", "海丰县", "陆河县", "其他"]
            },

            {
                "name": "河源",
                "area": ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县", "其他"]
            },

            {
                "name": "阳江",
                "area": ["江城区", "阳春市", "阳西县", "阳东县", "其他"]
            },

            {
                "name": "清远",
                "area": ["清城区", "英德市", "连州市", "佛冈县", "阳山县", "清新县", "连山壮族瑶族自治县", "连南瑶族自治县", "其他"]
            }

        ]
    },

    {
        "name": "广西",
        "city": [

            {
                "name": "南宁",
                "area": ["青秀区", "兴宁区", "西乡塘区", "良庆区", "江南区", "邕宁区", "武鸣县", "隆安县", "马山县", "上林县", "宾阳县", "横县", "其他"]
            },

            {
                "name": "柳州",
                "area": ["城中区", "鱼峰区", "柳北区", "柳南区", "柳江县", "柳城县", "鹿寨县", "融安县", "融水苗族自治县", "三江侗族自治县", "其他"]
            },

            {
                "name": "桂林",
                "area": ["象山区", "秀峰区", "叠彩区", "七星区", "雁山区", "阳朔县", "临桂县", "灵川县", "全州县", "平乐县", "兴安县", "灌阳县", "荔浦县", "资源县", "永福县", "龙胜各族自治县", "恭城瑶族自治县", "其他"]
            },

            {
                "name": "梧州",
                "area": ["万秀区", "蝶山区", "长洲区", "岑溪市", "苍梧县", "藤县", "蒙山县", "其他"]
            },

            {
                "name": "北海",
                "area": ["海城区", "银海区", "铁山港区", "合浦县", "其他"]
            },

            {
                "name": "防城港",
                "area": ["港口区", "防城区", "东兴市", "上思县", "其他"]
            },

            {
                "name": "钦州",
                "area": ["钦南区", "钦北区", "灵山县", "浦北县", "其他"]
            },

            {
                "name": "贵港",
                "area": ["港北区", "港南区", "覃塘区", "桂平市", "平南县", "其他"]
            },

            {
                "name": "玉林",
                "area": ["玉州区", "北流市", "容县", "陆川县", "博白县", "兴业县", "其他"]
            },

            {
                "name": "百色",
                "area": ["右江区", "凌云县", "平果县", "西林县", "乐业县", "德保县", "田林县", "田阳县", "靖西县", "田东县", "那坡县", "隆林各族自治县", "其他"]
            },

            {
                "name": "贺州",
                "area": ["八步区", "钟山县", "昭平县", "富川瑶族自治县", "其他"]
            },

            {
                "name": "河池",
                "area": ["金城江区", "宜州市", "天峨县", "凤山县", "南丹县", "东兰县", "都安瑶族自治县", "罗城仫佬族自治县", "巴马瑶族自治县", "环江毛南族自治县", "大化瑶族自治县", "其他"]
            },

            {
                "name": "来宾",
                "area": ["兴宾区", "合山市", "象州县", "武宣县", "忻城县", "金秀瑶族自治县", "其他"]
            },

            {
                "name": "崇左",
                "area": ["江州区", "凭祥市", "宁明县", "扶绥县", "龙州县", "大新县", "天等县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "海南",
        "city": [

            {
                "name": "海口",
                "area": ["龙华区", "秀英区", "琼山区", "美兰区", "其他"]
            },

            {
                "name": "三亚",
                "area": ["三亚市", "其他"]
            },

            {
                "name": "五指山",
                "area": ["五指山"]
            },

            {
                "name": "琼海",
                "area": ["琼海"]
            },

            {
                "name": "儋州",
                "area": ["儋州"]
            },

            {
                "name": "文昌",
                "area": ["文昌"]
            },

            {
                "name": "万宁",
                "area": ["万宁"]
            },

            {
                "name": "东方",
                "area": ["东方"]
            },

            {
                "name": "澄迈县",
                "area": ["澄迈县"]
            },

            {
                "name": "定安县",
                "area": ["定安县"]
            },

            {
                "name": "屯昌县",
                "area": ["屯昌县"]
            },

            {
                "name": "临高县",
                "area": ["临高县"]
            },

            {
                "name": "白沙黎族自治县",
                "area": ["白沙黎族自治县"]
            },

            {
                "name": "昌江黎族自治县",
                "area": ["昌江黎族自治县"]
            },

            {
                "name": "乐东黎族自治县",
                "area": ["乐东黎族自治县"]
            },

            {
                "name": "陵水黎族自治县",
                "area": ["陵水黎族自治县"]
            },

            {
                "name": "保亭黎族苗族自治县",
                "area": ["保亭黎族苗族自治县"]
            },

            {
                "name": "琼中黎族苗族自治县",
                "area": ["琼中黎族苗族自治县"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "重庆",
        "city": [

            {
                "name": "重庆",
                "area": ["渝中区", "大渡口区", "江北区", "南岸区", "北碚区", "渝北区", "巴南区", "长寿区", "双桥区", "沙坪坝区", "万盛区", "万州区", "涪陵区", "黔江区", "永川区", "合川区", "江津区", "九龙坡区", "南川区", "綦江县", "潼南县", "荣昌县", "璧山县", "大足县", "铜梁县", "梁平县", "开县", "忠县", "城口县", "垫江县", "武隆县", "丰都县", "奉节县", "云阳县", "巫溪县", "巫山县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "其他"]
            }

        ]
    },

    {
        "name": "四川",
        "city": [

            {
                "name": "成都",
                "area": ["青羊区", "锦江区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江区", "都江堰市", "彭州市", "邛崃市", "崇州市", "金堂县", "郫县", "新津县", "双流县", "蒲江县", "大邑县", "其他"]
            },

            {
                "name": "自贡",
                "area": ["大安区", "自流井区", "贡井区", "沿滩区", "荣县", "富顺县", "其他"]
            },

            {
                "name": "攀枝花",
                "area": ["仁和区", "米易县", "盐边县", "东区", "西区", "其他"]
            },

            {
                "name": "泸州",
                "area": ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县", "其他"]
            },

            {
                "name": "德阳",
                "area": ["旌阳区", "广汉市", "什邡市", "绵竹市", "罗江县", "中江县", "其他"]
            },

            {
                "name": "绵阳",
                "area": ["涪城区", "游仙区", "江油市", "盐亭县", "三台县", "平武县", "安县", "梓潼县", "北川羌族自治县", "其他"]
            },

            {
                "name": "广元",
                "area": ["元坝区", "朝天区", "青川县", "旺苍县", "剑阁县", "苍溪县", "市中区", "其他"]
            },

            {
                "name": "遂宁",
                "area": ["船山区", "安居区", "射洪县", "蓬溪县", "大英县", "其他"]
            },

            {
                "name": "内江",
                "area": ["市中区", "东兴区", "资中县", "隆昌县", "威远县", "其他"]
            },

            {
                "name": "乐山",
                "area": ["市中区", "五通桥区", "沙湾区", "金口河区", "峨眉山市", "夹江县", "井研县", "犍为县", "沐川县", "马边彝族自治县", "峨边彝族自治县", "其他"]
            },

            {
                "name": "南充",
                "area": ["顺庆区", "高坪区", "嘉陵区", "阆中市", "营山县", "蓬安县", "仪陇县", "南部县", "西充县", "其他"]
            },

            {
                "name": "眉山",
                "area": ["东坡区", "仁寿县", "彭山县", "洪雅县", "丹棱县", "青神县", "其他"]
            },

            {
                "name": "宜宾",
                "area": ["翠屏区", "宜宾县", "兴文县", "南溪县", "珙县", "长宁县", "高县", "江安县", "筠连县", "屏山县", "其他"]
            },

            {
                "name": "广安",
                "area": ["广安区", "华蓥市", "岳池县", "邻水县", "武胜县", "其他"]
            },

            {
                "name": "达州",
                "area": ["通川区", "万源市", "达县", "渠县", "宣汉县", "开江县", "大竹县", "其他"]
            },

            {
                "name": "雅安",
                "area": ["雨城区", "芦山县", "石棉县", "名山县", "天全县", "荥经县", "宝兴县", "汉源县", "其他"]
            },

            {
                "name": "巴中",
                "area": ["巴州区", "南江县", "平昌县", "通江县", "其他"]
            },

            {
                "name": "资阳",
                "area": ["雁江区", "简阳市", "安岳县", "乐至县", "其他"]
            },

            {
                "name": "阿坝藏族羌族自治州",
                "area": ["马尔康县", "九寨沟县", "红原县", "汶川县", "阿坝县", "理县", "若尔盖县", "小金县", "黑水县", "金川县", "松潘县", "壤塘县", "茂县", "其他"]
            },

            {
                "name": "甘孜藏族自治州",
                "area": ["康定县", "丹巴县", "炉霍县", "九龙县", "甘孜县", "雅江县", "新龙县", "道孚县", "白玉县", "理塘县", "德格县", "乡城县", "石渠县", "稻城县", "色达县", "巴塘县", "泸定县", "得荣县", "其他"]
            },

            {
                "name": "凉山彝族自治州",
                "area": ["西昌市", "美姑县", "昭觉县", "金阳县", "甘洛县", "布拖县", "雷波县", "普格县", "宁南县", "喜德县", "会东县", "越西县", "会理县", "盐源县", "德昌县", "冕宁县", "木里藏族自治县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "贵州",
        "city": [

            {
                "name": "贵阳",
                "area": ["南明区", "云岩区", "花溪区", "乌当区", "白云区", "小河区", "清镇市", "开阳县", "修文县", "息烽县", "其他"]
            },

            {
                "name": "六盘水",
                "area": ["钟山区", "水城县", "盘县", "六枝特区", "其他"]
            },

            {
                "name": "遵义",
                "area": ["红花岗区", "汇川区", "赤水市", "仁怀市", "遵义县", "绥阳县", "桐梓县", "习水县", "凤冈县", "正安县", "余庆县", "湄潭县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "其他"]
            },

            {
                "name": "安顺",
                "area": ["西秀区", "普定县", "平坝县", "镇宁布依族苗族自治县", "紫云苗族布依族自治县", "关岭布依族苗族自治县", "其他"]
            },

            {
                "name": "铜仁地区",
                "area": ["铜仁市", "德江县", "江口县", "思南县", "石阡县", "玉屏侗族自治县", "松桃苗族自治县", "印江土家族苗族自治县", "沿河土家族自治县", "万山特区", "其他"]
            },

            {
                "name": "毕节地区",
                "area": ["毕节市", "黔西县", "大方县", "织金县", "金沙县", "赫章县", "纳雍县", "威宁彝族回族苗族自治县", "其他"]
            },

            {
                "name": "黔西南布依族苗族自治州",
                "area": ["兴义市", "望谟县", "兴仁县", "普安县", "册亨县", "晴隆县", "贞丰县", "安龙县", "其他"]
            },

            {
                "name": "黔东南苗族侗族自治州",
                "area": ["凯里市", "施秉县", "从江县", "锦屏县", "镇远县", "麻江县", "台江县", "天柱县", "黄平县", "榕江县", "剑河县", "三穗县", "雷山县", "黎平县", "岑巩县", "丹寨县", "其他"]
            },

            {
                "name": "黔南布依族苗族自治州",
                "area": ["都匀市", "福泉市", "贵定县", "惠水县", "罗甸县", "瓮安县", "荔波县", "龙里县", "平塘县", "长顺县", "独山县", "三都水族自治县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "云南",
        "city": [

            {
                "name": "昆明",
                "area": ["盘龙区", "五华区", "官渡区", "西山区", "东川区", "安宁市", "呈贡县", "晋宁县", "富民县", "宜良县", "嵩明县", "石林彝族自治县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "其他"]
            },

            {
                "name": "曲靖",
                "area": ["麒麟区", "宣威市", "马龙县", "沾益县", "富源县", "罗平县", "师宗县", "陆良县", "会泽县", "其他"]
            },

            {
                "name": "玉溪",
                "area": ["红塔区", "江川县", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县", "其他"]
            },

            {
                "name": "保山",
                "area": ["隆阳区", "施甸县", "腾冲县", "龙陵县", "昌宁县", "其他"]
            },

            {
                "name": "昭通",
                "area": ["昭阳区", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "水富县", "其他"]
            },

            {
                "name": "丽江",
                "area": ["古城区", "永胜县", "华坪县", "玉龙纳西族自治县", "宁蒗彝族自治县", "其他"]
            },

            {
                "name": "普洱",
                "area": ["思茅区", "普洱哈尼族彝族自治县", "墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县", "其他"]
            },

            {
                "name": "临沧",
                "area": ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县", "其他"]
            },

            {
                "name": "德宏傣族景颇族自治州",
                "area": ["潞西市", "瑞丽市", "梁河县", "盈江县", "陇川县", "其他"]
            },

            {
                "name": "怒江傈僳族自治州",
                "area": ["泸水县", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县", "其他"]
            },

            {
                "name": "迪庆藏族自治州",
                "area": ["香格里拉县", "德钦县", "维西傈僳族自治县", "其他"]
            },

            {
                "name": "大理白族自治州",
                "area": ["大理市", "祥云县", "宾川县", "弥渡县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县", "漾濞彝族自治县", "南涧彝族自治县", "巍山彝族回族自治县", "其他"]
            },

            {
                "name": "楚雄彝族自治州",
                "area": ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县", "其他"]
            },

            {
                "name": "红河哈尼族彝族自治州",
                "area": ["蒙自县", "个旧市", "开远市", "绿春县", "建水县", "石屏县", "弥勒县", "泸西县", "元阳县", "红河县", "金平苗族瑶族傣族自治县", "河口瑶族自治县", "屏边苗族自治县", "其他"]
            },

            {
                "name": "文山壮族苗族自治州",
                "area": ["文山县", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县", "其他"]
            },

            {
                "name": "西双版纳傣族自治州",
                "area": ["景洪市", "勐海县", "勐腊县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "西藏",
        "city": [

            {
                "name": "拉萨",
                "area": ["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆县", "达孜县", "墨竹工卡县", "其他"]
            },

            {
                "name": "那曲地区",
                "area": ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县", "其他"]
            },

            {
                "name": "昌都地区",
                "area": ["昌都县", "江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县", "其他"]
            },

            {
                "name": "林芝地区",
                "area": ["林芝县", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县", "其他"]
            },

            {
                "name": "山南地区",
                "area": ["乃东县", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县", "其他"]
            },

            {
                "name": "日喀则地区",
                "area": ["日喀则市", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县", "其他"]
            },

            {
                "name": "阿里地区",
                "area": ["噶尔县", "普兰县", "札达县", "日土县", "革吉县", "改则县", "措勤县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "陕西",
        "city": [

            {
                "name": "西安",
                "area": ["莲湖区", "新城区", "碑林区", "雁塔区", "灞桥区", "未央区", "阎良区", "临潼区", "长安区", "高陵县", "蓝田县", "户县", "周至县", "其他"]
            },

            {
                "name": "铜川",
                "area": ["耀州区", "王益区", "印台区", "宜君县", "其他"]
            },

            {
                "name": "宝鸡",
                "area": ["渭滨区", "金台区", "陈仓区", "岐山县", "凤翔县", "陇县", "太白县", "麟游县", "扶风县", "千阳县", "眉县", "凤县", "其他"]
            },

            {
                "name": "咸阳",
                "area": ["秦都区", "渭城区", "杨陵区", "兴平市", "礼泉县", "泾阳县", "永寿县", "三原县", "彬县", "旬邑县", "长武县", "乾县", "武功县", "淳化县", "其他"]
            },

            {
                "name": "渭南",
                "area": ["临渭区", "韩城市", "华阴市", "蒲城县", "潼关县", "白水县", "澄城县", "华县", "合阳县", "富平县", "大荔县", "其他"]
            },

            {
                "name": "延安",
                "area": ["宝塔区", "安塞县", "洛川县", "子长县", "黄陵县", "延川县", "富县", "延长县", "甘泉县", "宜川县", "志丹县", "黄龙县", "吴起县", "其他"]
            },

            {
                "name": "汉中",
                "area": ["汉台区", "留坝县", "镇巴县", "城固县", "南郑县", "洋县", "宁强县", "佛坪县", "勉县", "西乡县", "略阳县", "其他"]
            },

            {
                "name": "榆林",
                "area": ["榆阳区", "清涧县", "绥德县", "神木县", "佳县", "府谷县", "子洲县", "靖边县", "横山县", "米脂县", "吴堡县", "定边县", "其他"]
            },

            {
                "name": "安康",
                "area": ["汉滨区", "紫阳县", "岚皋县", "旬阳县", "镇坪县", "平利县", "石泉县", "宁陕县", "白河县", "汉阴县", "其他"]
            },

            {
                "name": "商洛",
                "area": ["商州区", "镇安县", "山阳县", "洛南县", "商南县", "丹凤县", "柞水县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "甘肃",
        "city": [

            {
                "name": "兰州",
                "area": ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县", "其他"]
            },

            {
                "name": "嘉峪关",
                "area": ["嘉峪关市", "其他"]
            },

            {
                "name": "金昌",
                "area": ["金川区", "永昌县", "其他"]
            },

            {
                "name": "白银",
                "area": ["白银区", "平川区", "靖远县", "会宁县", "景泰县", "其他"]
            },

            {
                "name": "天水",
                "area": ["清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县", "北道区", "秦城区", "其他"]
            },

            {
                "name": "武威",
                "area": ["凉州区", "民勤县", "古浪县", "天祝藏族自治县", "其他"]
            },

            {
                "name": "酒泉",
                "area": ["肃州区", "玉门市", "敦煌市", "金塔县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "安西县", "其他"]
            },

            {
                "name": "张掖",
                "area": ["甘州区", "民乐县", "临泽县", "高台县", "山丹县", "肃南裕固族自治县", "其他"]
            },

            {
                "name": "庆阳",
                "area": ["西峰区", "庆城县", "环县", "华池县", "合水县", "正宁县", "宁县", "镇原县", "其他"]
            },

            {
                "name": "平凉",
                "area": ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县", "其他"]
            },

            {
                "name": "定西",
                "area": ["安定区", "通渭县", "临洮县", "漳县", "岷县", "渭源县", "陇西县", "其他"]
            },

            {
                "name": "陇南",
                "area": ["武都区", "成县", "宕昌县", "康县", "文县", "西和县", "礼县", "两当县", "徽县", "其他"]
            },

            {
                "name": "临夏回族自治州",
                "area": ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县", "其他"]
            },

            {
                "name": "甘南藏族自治州",
                "area": ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "青海",
        "city": [

            {
                "name": "西宁",
                "area": ["城中区", "城东区", "城西区", "城北区", "湟源县", "湟中县", "大通回族土族自治县", "其他"]
            },

            {
                "name": "海东地区",
                "area": ["平安县", "乐都县", "民和回族土族自治县", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县", "其他"]
            },

            {
                "name": "海北藏族自治州",
                "area": ["海晏县", "祁连县", "刚察县", "门源回族自治县", "其他"]
            },

            {
                "name": "海南藏族自治州",
                "area": ["共和县", "同德县", "贵德县", "兴海县", "贵南县", "其他"]
            },

            {
                "name": "黄南藏族自治州",
                "area": ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县", "其他"]
            },

            {
                "name": "果洛藏族自治州",
                "area": ["玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县", "其他"]
            },

            {
                "name": "玉树藏族自治州",
                "area": ["玉树县", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县", "其他"]
            },

            {
                "name": "海西蒙古族藏族自治州",
                "area": ["德令哈市", "格尔木市", "乌兰县", "都兰县", "天峻县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "宁夏",
        "city": [

            {
                "name": "银川",
                "area": ["兴庆区", "西夏区", "金凤区", "灵武市", "永宁县", "贺兰县", "其他"]
            },

            {
                "name": "石嘴山",
                "area": ["大武口区", "惠农区", "平罗县", "其他"]
            },

            {
                "name": "吴忠",
                "area": ["利通区", "青铜峡市", "盐池县", "同心县", "其他"]
            },

            {
                "name": "固原",
                "area": ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县", "其他"]
            },

            {
                "name": "中卫",
                "area": ["沙坡头区", "中宁县", "海原县", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "新疆",
        "city": [

            {
                "name": "乌鲁木齐",
                "area": ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "东山区", "乌鲁木齐县", "其他"]
            },

            {
                "name": "克拉玛依",
                "area": ["克拉玛依区", "独山子区", "白碱滩区", "乌尔禾区", "其他"]
            },

            {
                "name": "吐鲁番地区",
                "area": ["吐鲁番市", "托克逊县", "鄯善县", "其他"]
            },

            {
                "name": "哈密地区",
                "area": ["哈密市", "伊吾县", "巴里坤哈萨克自治县", "其他"]
            },

            {
                "name": "和田地区",
                "area": ["和田市", "和田县", "洛浦县", "民丰县", "皮山县", "策勒县", "于田县", "墨玉县", "其他"]
            },

            {
                "name": "阿克苏地区",
                "area": ["阿克苏市", "温宿县", "沙雅县", "拜城县", "阿瓦提县", "库车县", "柯坪县", "新和县", "乌什县", "其他"]
            },

            {
                "name": "喀什地区",
                "area": ["喀什市", "巴楚县", "泽普县", "伽师县", "叶城县", "岳普湖县", "疏勒县", "麦盖提县", "英吉沙县", "莎车县", "疏附县", "塔什库尔干塔吉克自治县", "其他"]
            },

            {
                "name": "克孜勒苏柯尔克孜自治州",
                "area": ["阿图什市", "阿合奇县", "乌恰县", "阿克陶县", "其他"]
            },

            {
                "name": "巴音郭楞蒙古自治州",
                "area": ["库尔勒市", "和静县", "尉犁县", "和硕县", "且末县", "博湖县", "轮台县", "若羌县", "焉耆回族自治县", "其他"]
            },

            {
                "name": "昌吉回族自治州",
                "area": ["昌吉市", "阜康市", "奇台县", "玛纳斯县", "吉木萨尔县", "呼图壁县", "木垒哈萨克自治县", "米泉市", "其他"]
            },

            {
                "name": "博尔塔拉蒙古自治州",
                "area": ["博乐市", "精河县", "温泉县", "其他"]
            },

            {
                "name": "石河子",
                "area": ["石河子"]
            },

            {
                "name": "阿拉尔",
                "area": ["阿拉尔"]
            },

            {
                "name": "图木舒克",
                "area": ["图木舒克"]
            },

            {
                "name": "五家渠",
                "area": ["五家渠"]
            },

            {
                "name": "伊犁哈萨克自治州",
                "area": ["伊宁市", "奎屯市", "伊宁县", "特克斯县", "尼勒克县", "昭苏县", "新源县", "霍城县", "巩留县", "察布查尔锡伯自治县", "塔城地区", "阿勒泰地区", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "台湾",
        "city": [

            {
                "name": "台湾",
                "area": ["台北市", "高雄市", "台北县", "桃园县", "新竹县", "苗栗县", "台中县", "彰化县", "南投县", "云林县", "嘉义县", "台南县", "高雄县", "屏东县", "宜兰县", "花莲县", "台东县", "澎湖县", "基隆市", "新竹市", "台中市", "嘉义市", "台南市", "其他"]
            },

            {
                "name": "其他",
                "area": ["其他"]
            }

        ]
    },

    {
        "name": "澳门",
        "city": [

            {
                "name": "澳门",
                "area": ["花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区", "路凼", "其他"]
            }

        ]
    },

    {
        "name": "香港",
        "city": [

            {
                "name": "香港",
                "area": ["中西区", "湾仔区", "东区", "南区", "深水埗区", "油尖旺区", "九龙城区", "黄大仙区", "观塘区", "北区", "大埔区", "沙田区", "西贡区", "元朗区", "屯门区", "荃湾区", "葵青区", "离岛区", "其他"]
            }

        ]
    },

    {
        "name": "钓鱼岛",
        "city": [

            {
                "name": "钓鱼岛",
                "area": ["钓鱼岛"]
            }

        ]
    }
]

module.exports = {
    musicData: myMusic,
    expressList: expressList,
    cityList: cityList
}